#include "math.h"     // математические функции
#include "PACRXPlc.h" //процедуры для контроллера PAC
//#include "plcc9070.h" //процедуры для контроллера 90-70



//***************************************************** main **********************************************************
void GefMain(/*Входы*/IN, Num, Break,
			 /*Выходы*/ NumOK, Tsr, Tmin, Tmin_sr, Tmax)
T_INT16 *IN; 		//массив температур
T_INT16 *Num; 		//количество термопар
T_INT16 *Break; 	//признак отбрасывания крайних значений при расчете средней (1-отбрасывать, 0-не отбрасывать)

T_INT16 *NumOK;		//количество исправных термопар
T_INT16 *Tsr;		//средняя температура
T_INT16 *Tmin;		//минимальная температура исправной термопары
T_INT16 *Tmin_sr;	//минимально возможная температура (Tsr - a)
T_INT16 *Tmax;		//максимальная температура исправной термопары


{
T_INT16 i, j; 
T_REAL32 sum, Tsr_all, dT, IN_R[50], IN_R1[50], a, Tmin_R, Tmax_R;

//float sum;
a = 50;
sum=0;
j=0;

//Если количество термопар = 0, то переход в конец
if (*Num>0)
	{
	//Переводим в Real
	for (i=0; i< *Num; i++)
		IN_R[i] = IN[i] / 10;
		
	if (FST_EXE)
		{
		for (i=0; i< *Num; i++)
			sum= sum + (IN[i] / 10);
		//среднее арифметическое всех температур
		Tsr_all = (sum / *Num);
		}
	else
		Tsr_all= *Tsr /10;
	
	for (i=0; i< *Num; i++)
		{
		//вычисляем отклонение от среднего
		dT = abs(IN_R[i] - Tsr_all);
		//dT = abs(IN_R[i] - (*Tsr/10));
		//если отклонение меньше погрешности, то считаем сигнал достоверным
		if (dT < a) 
			{
			//сохраняем достоверный сигнал в другой массив
			IN_R1[j]= IN_R[i];
			j++;
			}
		}
	//Количество исправных термопар
	*NumOK = j;
	
	//перебор всех исправных термопар
	Tmin_R= IN_R1[0];
	Tmax_R= IN_R1[0];
	sum= 0;
	for (i=0; i<j; i++)
		{
		if (IN_R1[i] < Tmin_R) Tmin_R= IN_R1[i];
		if (IN_R1[i] > Tmax_R) Tmax_R= IN_R1[i];
		sum= sum + IN_R1[i];
		}
	
	//убираем из суммы минимальную и максимальную температуры
	if (*Break == 1)
		{
		sum= sum - Tmin_R - Tmax_R;
		j= j-2;
		}
	*Tmin = Tmin_R * 10;
	*Tmax = Tmax_R * 10;
	//средняя температура
	*Tsr = (sum  / j) * 10;
	*Tmin_sr = *Tsr - (a*10);

	} //if (*Num!=0)
}
