#include "math.h"     // математические функции
#include "PACRXPlc.h" //процедуры для контроллера PAC
//#include "plcc9070.h" //процедуры для контроллера 90-70

#include "init.h"  //Инициализация

#include "syst_char.h" // Линейная интерполяция




void GefMain(/*Входы*/IN, 
			 /*Выходы*/ OUT, 
			 /*Константы*/ Const)
float *IN;
float *OUT;
float *Const;

//void GefMain(/*Входы*/float N,float *P_IN, float *P_OUT, float *T_IN, 
//				/*Выходы*/ float *Ky, float *Q_35ata,  float *Q_pr,
//				/*Константы*/ float Nnom, float *Q_min, float *p_g, float *B)

/*
#define Nnom 22300 	//Номинальные обороты нагнетателя
#define Q_min 12.3  	//Запас по помпажу
#define p_g 0.68 		// плотность газа кг/м3
#define B 750		// барометрическое давление мм.рт.ст
*/
//main() // для 90-70
{
//syst_char(Rc, *Xn, *Yn, number, Xtype, *Q_35ata,  *fault);   //syst_char(T_REAL32 X, T_REAL32 *Xn, T_REAL32 *Yn, T_INT16 number, T_INT16 Xtype, T_REAL32 *Y, T_REAL32  *fault)

float Xn[16], Yn[16], B_, Pin, Tin, p_, R, Tkr, Tpr, Pkr, Ppr, Zin, p_in, /*Q_pr,*/ Q, Rc;
int number, Xtype, fault;
float N,P_IN,P_OUT,T_IN, Ky, Q_35ata, Q_pr, Nnom, Q_min, p_g, B;

N= IN[0];
P_IN= IN[1];
P_OUT= IN[2];
T_IN= IN[3];

Nnom= Const[0];
Q_min= Const[1];
p_g= Const[2];
B= Const[3];


if ((N>=14000.0)&&(N<15000.0))
	{
	Xtype=char14000_Xtype;
	number=char14000_number;
	Xn[0]=char14000_Xn[0]+(N-14000.0)*0.00014642857;
	Xn[1]=char14000_Xn[1]+(N-14000.0)*0.00014642857;
	Xn[2]=char14000_Xn[2]+(N-14000.0)*0.00014642857;
	Xn[3]=char14000_Xn[3]+(N-14000.0)*0.00014642857;
	Xn[4]=char14000_Xn[4]+(N-14000.0)*0.00014642857;
	Xn[5]=char14000_Xn[5]+(N-14000.0)*0.00014642857;
	Xn[6]=char14000_Xn[6]+(N-14000.0)*0.00014642857;
	Xn[7]=char14000_Xn[7]+(N-14000.0)*0.00014642857;
	Xn[8]=char14000_Xn[8]+(N-14000.0)*0.00014642857;
	Xn[9]=char14000_Xn[9]+(N-14000.0)*0.00014642857;
	Xn[10]=char14000_Xn[10]+(N-14000.0)*0.00014642857;
	Xn[11]=char14000_Xn[11]+(N-14000.0)*0.00014642857;
	Xn[12]=char14000_Xn[12]+(N-14000.0)*0.00014642857;
	Xn[13]=char14000_Xn[13]+(N-14000.0)*0.00014642857;
	Xn[14]=char14000_Xn[14]+(N-14000.0)*0.00014642857;
	Xn[15]=char14000_Xn[15]+(N-14000.0)*0.00014642857;

	Yn[0]=char14000_Yn[0];
	Yn[1]=char14000_Yn[1];
	Yn[2]=char14000_Yn[2];
	Yn[3]=char14000_Yn[3];
	Yn[4]=char14000_Yn[4];
	Yn[5]=char14000_Yn[5];
	Yn[6]=char14000_Yn[6];
	Yn[7]=char14000_Yn[7];
	Yn[8]=char14000_Yn[8];
	Yn[9]=char14000_Yn[9];
	Yn[10]=char14000_Yn[10];
	Yn[11]=char14000_Yn[11];
	Yn[12]=char14000_Yn[12];
	Yn[13]=char14000_Yn[13];
	Yn[14]=char14000_Yn[14];
	Yn[15]=char14000_Yn[15];
	}

if ((N>=15000.0)&&(N<16000.0))
	{
	Xtype=char15000_Xtype;
	number=char15000_number;
	Xn[0]=char15000_Xn[0]+(N-15000.0)*0.00016428571;
	Xn[1]=char15000_Xn[1]+(N-15000.0)*0.00016428571;
	Xn[2]=char15000_Xn[2]+(N-15000.0)*0.00016428571;
	Xn[3]=char15000_Xn[3]+(N-15000.0)*0.00016428571;
	Xn[4]=char15000_Xn[4]+(N-15000.0)*0.00016428571;
	Xn[5]=char15000_Xn[5]+(N-15000.0)*0.00016428571;
	Xn[6]=char15000_Xn[6]+(N-15000.0)*0.00016428571;
	Xn[7]=char15000_Xn[7]+(N-15000.0)*0.00016428571;
	Xn[8]=char15000_Xn[8]+(N-15000.0)*0.00016428571;
	Xn[9]=char15000_Xn[9]+(N-15000.0)*0.00016428571;
	Xn[10]=char15000_Xn[10]+(N-15000.0)*0.00016428571;
	Xn[11]=char15000_Xn[11]+(N-15000.0)*0.00016428571;
	Xn[12]=char15000_Xn[12]+(N-15000.0)*0.00016428571;
	Xn[13]=char15000_Xn[13]+(N-15000.0)*0.00016428571;
	Xn[14]=char15000_Xn[14]+(N-15000.0)*0.00016428571;
	Xn[15]=char15000_Xn[15]+(N-15000.0)*0.00016428571;

	Yn[0]=char15000_Yn[0];
	Yn[1]=char15000_Yn[1];
	Yn[2]=char15000_Yn[2];
	Yn[3]=char15000_Yn[3];
	Yn[4]=char15000_Yn[4];
	Yn[5]=char15000_Yn[5];
	Yn[6]=char15000_Yn[6];
	Yn[7]=char15000_Yn[7];
	Yn[8]=char15000_Yn[8];
	Yn[9]=char15000_Yn[9];
	Yn[10]=char15000_Yn[10];
	Yn[11]=char15000_Yn[11];
	Yn[12]=char15000_Yn[12];
	Yn[13]=char15000_Yn[13];
	Yn[14]=char15000_Yn[14];
	Yn[15]=char15000_Yn[15];
	}


if ((N>=16000.0)&&(N<17000.0))
	{
	Xtype=char16000_Xtype;
	number=char16000_number;
	Xn[0]=char16000_Xn[0]+(N-16000.0)*0.00017142857;
	Xn[1]=char16000_Xn[1]+(N-16000.0)*0.00017142857;
	Xn[2]=char16000_Xn[2]+(N-16000.0)*0.00017142857;
	Xn[3]=char16000_Xn[3]+(N-16000.0)*0.00017142857;
	Xn[4]=char16000_Xn[4]+(N-16000.0)*0.00017142857;
	Xn[5]=char16000_Xn[5]+(N-16000.0)*0.00017142857;
	Xn[6]=char16000_Xn[6]+(N-16000.0)*0.00017142857;
	Xn[7]=char16000_Xn[7]+(N-16000.0)*0.00017142857;
	Xn[8]=char16000_Xn[8]+(N-16000.0)*0.00017142857;
	Xn[9]=char16000_Xn[9]+(N-16000.0)*0.00017142857;
	Xn[10]=char16000_Xn[10]+(N-16000.0)*0.00017142857;
	Xn[11]=char16000_Xn[11]+(N-16000.0)*0.00017142857;
	Xn[12]=char16000_Xn[12]+(N-16000.0)*0.00017142857;
	Xn[13]=char16000_Xn[13]+(N-16000.0)*0.00017142857;
	Xn[14]=char16000_Xn[14]+(N-16000.0)*0.00017142857;
	Xn[15]=char16000_Xn[15]+(N-16000.0)*0.00017142857;

	Yn[0]=char16000_Yn[0];
	Yn[1]=char16000_Yn[1];
	Yn[2]=char16000_Yn[2];
	Yn[3]=char16000_Yn[3];
	Yn[4]=char16000_Yn[4];
	Yn[5]=char16000_Yn[5];
	Yn[6]=char16000_Yn[6];
	Yn[7]=char16000_Yn[7];
	Yn[8]=char16000_Yn[8];
	Yn[9]=char16000_Yn[9];
	Yn[10]=char16000_Yn[10];
	Yn[11]=char16000_Yn[11];
	Yn[12]=char16000_Yn[12];
	Yn[13]=char16000_Yn[13];
	Yn[14]=char16000_Yn[14];
	Yn[15]=char16000_Yn[15];
	}

if ((N>=17000.0)&&(N<18000.0))
	{
	Xtype=char17000_Xtype;
	number=char17000_number;
	Xn[0]=char17000_Xn[0]+(N-17000.0)*0.00021071429;
	Xn[1]=char17000_Xn[1]+(N-17000.0)*0.00021071429;
	Xn[2]=char17000_Xn[2]+(N-17000.0)*0.00021071429;
	Xn[3]=char17000_Xn[3]+(N-17000.0)*0.00021071429;
	Xn[4]=char17000_Xn[4]+(N-17000.0)*0.00021071429;
	Xn[5]=char17000_Xn[5]+(N-17000.0)*0.00021071429;
	Xn[6]=char17000_Xn[6]+(N-17000.0)*0.00021071429;
	Xn[7]=char17000_Xn[7]+(N-17000.0)*0.00021071429;
	Xn[8]=char17000_Xn[8]+(N-17000.0)*0.00021071429;
	Xn[9]=char17000_Xn[9]+(N-17000.0)*0.00021071429;
	Xn[10]=char17000_Xn[10]+(N-17000.0)*0.00021071429;
	Xn[11]=char17000_Xn[11]+(N-17000.0)*0.00021071429;
	Xn[12]=char17000_Xn[12]+(N-17000.0)*0.00021071429;
	Xn[13]=char17000_Xn[13]+(N-17000.0)*0.00021071429;
	Xn[14]=char17000_Xn[14]+(N-17000.0)*0.00021071429;
	Xn[15]=char17000_Xn[15]+(N-17000.0)*0.00021071429;

	Yn[0]=char17000_Yn[0];
	Yn[1]=char17000_Yn[1];
	Yn[2]=char17000_Yn[2];
	Yn[3]=char17000_Yn[3];
	Yn[4]=char17000_Yn[4];
	Yn[5]=char17000_Yn[5];
	Yn[6]=char17000_Yn[6];
	Yn[7]=char17000_Yn[7];
	Yn[8]=char17000_Yn[8];
	Yn[9]=char17000_Yn[9];
	Yn[10]=char17000_Yn[10];
	Yn[11]=char17000_Yn[11];
	Yn[12]=char17000_Yn[12];
	Yn[13]=char17000_Yn[13];
	Yn[14]=char17000_Yn[14];
	Yn[15]=char17000_Yn[15];
	}

if ((N>=18000.0)&&(N<19000.0))
	{
	Xtype=char18000_Xtype;
	number=char18000_number;
	Xn[0]=char18000_Xn[0]+(N-18000.0)*0.00021071429;
	Xn[1]=char18000_Xn[1]+(N-18000.0)*0.00021071429;
	Xn[2]=char18000_Xn[2]+(N-18000.0)*0.00021071429;
	Xn[3]=char18000_Xn[3]+(N-18000.0)*0.00021071429;
	Xn[4]=char18000_Xn[4]+(N-18000.0)*0.00021071429;
	Xn[5]=char18000_Xn[5]+(N-18000.0)*0.00021071429;
	Xn[6]=char18000_Xn[6]+(N-18000.0)*0.00021071429;
	Xn[7]=char18000_Xn[7]+(N-18000.0)*0.00021071429;
	Xn[8]=char18000_Xn[8]+(N-18000.0)*0.00021071429;
	Xn[9]=char18000_Xn[9]+(N-18000.0)*0.00021071429;
	Xn[10]=char18000_Xn[10]+(N-18000.0)*0.00021071429;
	Xn[11]=char18000_Xn[11]+(N-18000.0)*0.00021071429;
	Xn[12]=char18000_Xn[12]+(N-18000.0)*0.00021071429;
	Xn[13]=char18000_Xn[13]+(N-18000.0)*0.00021071429;
	Xn[14]=char18000_Xn[14]+(N-18000.0)*0.00021071429;
	Xn[15]=char18000_Xn[15]+(N-18000.0)*0.00021071429;

	Yn[0]=char18000_Yn[0];
	Yn[1]=char18000_Yn[1];
	Yn[2]=char18000_Yn[2];
	Yn[3]=char18000_Yn[3];
	Yn[4]=char18000_Yn[4];
	Yn[5]=char18000_Yn[5];
	Yn[6]=char18000_Yn[6];
	Yn[7]=char18000_Yn[7];
	Yn[8]=char18000_Yn[8];
	Yn[9]=char18000_Yn[9];
	Yn[10]=char18000_Yn[10];
	Yn[11]=char18000_Yn[11];
	Yn[12]=char18000_Yn[12];
	Yn[13]=char18000_Yn[13];
	Yn[14]=char18000_Yn[14];
	Yn[15]=char18000_Yn[15];
	}

if ((N>=19000.0)&&(N<20000.0))
	{
	Xtype=char19000_Xtype;
	number=char19000_number;
	Xn[0]=char19000_Xn[0]+(N-19000.0)*0.00024285714;
	Xn[1]=char19000_Xn[1]+(N-19000.0)*0.00024285714;
	Xn[2]=char19000_Xn[2]+(N-19000.0)*0.00024285714;
	Xn[3]=char19000_Xn[3]+(N-19000.0)*0.00024285714;
	Xn[4]=char19000_Xn[4]+(N-19000.0)*0.00024285714;
	Xn[5]=char19000_Xn[5]+(N-19000.0)*0.00024285714;
	Xn[6]=char19000_Xn[6]+(N-19000.0)*0.00024285714;
	Xn[7]=char19000_Xn[7]+(N-19000.0)*0.00024285714;
	Xn[8]=char19000_Xn[8]+(N-19000.0)*0.00024285714;
	Xn[9]=char19000_Xn[9]+(N-19000.0)*0.00024285714;
	Xn[10]=char19000_Xn[10]+(N-19000.0)*0.00024285714;
	Xn[11]=char19000_Xn[11]+(N-19000.0)*0.00024285714;
	Xn[12]=char19000_Xn[12]+(N-19000.0)*0.00024285714;
	Xn[13]=char19000_Xn[13]+(N-19000.0)*0.00024285714;
	Xn[14]=char19000_Xn[14]+(N-19000.0)*0.00024285714;
	Xn[15]=char19000_Xn[15]+(N-19000.0)*0.00024285714;

	Yn[0]=char19000_Yn[0];
	Yn[1]=char19000_Yn[1];
	Yn[2]=char19000_Yn[2];
	Yn[3]=char19000_Yn[3];
	Yn[4]=char19000_Yn[4];
	Yn[5]=char19000_Yn[5];
	Yn[6]=char19000_Yn[6];
	Yn[7]=char19000_Yn[7];
	Yn[8]=char19000_Yn[8];
	Yn[9]=char19000_Yn[9];
	Yn[10]=char19000_Yn[10];
	Yn[11]=char19000_Yn[11];
	Yn[12]=char19000_Yn[12];
	Yn[13]=char19000_Yn[13];
	Yn[14]=char19000_Yn[14];
	Yn[15]=char19000_Yn[15];
	}

if ((N>=20000.0)&&(N<21000.0))
	{
	Xtype=char20000_Xtype;
	number=char20000_number;
	Xn[0]=char20000_Xn[0]+(N-20000.0)*0.00027142857;
	Xn[1]=char20000_Xn[1]+(N-20000.0)*0.00027142857;
	Xn[2]=char20000_Xn[2]+(N-20000.0)*0.00027142857;
	Xn[3]=char20000_Xn[3]+(N-20000.0)*0.00027142857;
	Xn[4]=char20000_Xn[4]+(N-20000.0)*0.00027142857;
	Xn[5]=char20000_Xn[5]+(N-20000.0)*0.00027142857;
	Xn[6]=char20000_Xn[6]+(N-20000.0)*0.00027142857;
	Xn[7]=char20000_Xn[7]+(N-20000.0)*0.00027142857;
	Xn[8]=char20000_Xn[8]+(N-20000.0)*0.00027142857;
	Xn[9]=char20000_Xn[9]+(N-20000.0)*0.00027142857;
	Xn[10]=char20000_Xn[10]+(N-20000.0)*0.00027142857;
	Xn[11]=char20000_Xn[11]+(N-20000.0)*0.00027142857;
	Xn[12]=char20000_Xn[12]+(N-20000.0)*0.00027142857;
	Xn[13]=char20000_Xn[13]+(N-20000.0)*0.00027142857;
	Xn[14]=char20000_Xn[14]+(N-20000.0)*0.00027142857;
	Xn[15]=char20000_Xn[15]+(N-20000.0)*0.00027142857;

	Yn[0]=char20000_Yn[0];
	Yn[1]=char20000_Yn[1];
	Yn[2]=char20000_Yn[2];
	Yn[3]=char20000_Yn[3];
	Yn[4]=char20000_Yn[4];
	Yn[5]=char20000_Yn[5];
	Yn[6]=char20000_Yn[6];
	Yn[7]=char20000_Yn[7];
	Yn[8]=char20000_Yn[8];
	Yn[9]=char20000_Yn[9];
	Yn[10]=char20000_Yn[10];
	Yn[11]=char20000_Yn[11];
	Yn[12]=char20000_Yn[12];
	Yn[13]=char20000_Yn[13];
	Yn[14]=char20000_Yn[14];
	Yn[15]=char20000_Yn[15];
	}

if ((N>=21000.0)&&(N<22000.0))
	{
	Xtype=char21000_Xtype;
	number=char21000_number;
	Xn[0]=char21000_Xn[0]+(N-21000.0)*0.00029285714;
	Xn[1]=char21000_Xn[1]+(N-21000.0)*0.00029285714;
	Xn[2]=char21000_Xn[2]+(N-21000.0)*0.00029285714;
	Xn[3]=char21000_Xn[3]+(N-21000.0)*0.00029285714;
	Xn[4]=char21000_Xn[4]+(N-21000.0)*0.00029285714;
	Xn[5]=char21000_Xn[5]+(N-21000.0)*0.00029285714;
	Xn[6]=char21000_Xn[6]+(N-21000.0)*0.00029285714;
	Xn[7]=char21000_Xn[7]+(N-21000.0)*0.00029285714;
	Xn[8]=char21000_Xn[8]+(N-21000.0)*0.00029285714;
	Xn[9]=char21000_Xn[9]+(N-21000.0)*0.00029285714;
	Xn[10]=char21000_Xn[10]+(N-21000.0)*0.00029285714;
	Xn[11]=char21000_Xn[11]+(N-21000.0)*0.00029285714;
	Xn[12]=char21000_Xn[12]+(N-21000.0)*0.00029285714;
	Xn[13]=char21000_Xn[13]+(N-21000.0)*0.00029285714;
	Xn[14]=char21000_Xn[14]+(N-21000.0)*0.00029285714;
	Xn[15]=char21000_Xn[15]+(N-21000.0)*0.00029285714;

	Yn[0]=char21000_Yn[0];
	Yn[1]=char21000_Yn[1];
	Yn[2]=char21000_Yn[2];
	Yn[3]=char21000_Yn[3];
	Yn[4]=char21000_Yn[4];
	Yn[5]=char21000_Yn[5];
	Yn[6]=char21000_Yn[6];
	Yn[7]=char21000_Yn[7];
	Yn[8]=char21000_Yn[8];
	Yn[9]=char21000_Yn[9];
	Yn[10]=char21000_Yn[10];
	Yn[11]=char21000_Yn[11];
	Yn[12]=char21000_Yn[12];
	Yn[13]=char21000_Yn[13];
	Yn[14]=char21000_Yn[14];
	Yn[15]=char21000_Yn[15];
	}

//Степень сжатия
Rc = P_OUT / P_IN;	
	
if ((N >= 14000) && (N < 22000))
	fault = syst_char(Rc, Xn, Yn, number, Xtype, OUT);  
	Q_35ata = OUT[1];
	//syst_char(T_REAL32 X, T_REAL32 *Xn, T_REAL32 *Yn, T_INT16 number, T_INT16 Xtype, T_REAL32 *Y, T_REAL32  *fault)

if (N < 14000) Q_35ata=0;

//Барометрическое давление, (ks/cm2)
B_= B * 1.0332/760.0;

//Давление на входе в нагнетатель, (ks/cm2)
Pin= P_IN /* * 0.010197*/ + B_;
if (Pin == 0.0) Pin= 0.0000001; 

//Температура на входе в нагнетатель, (grK)
Tin= T_IN+273.2;

//Относительная плотность газа
p_= p_g/1.205;

//Газовая постоянная
if (p_!= 0.0) R= 29.27/p_;
else R= 1;

//Псевдокритическая температура
Tkr= 162.8 * (0.613+p_);

//Псевдокритическое давление
Pkr= 47.9-p_;
if (Pkr == 0.0) Pkr= 0.0001; 

//Предельная температура
if (Tkr != 0.0) Tpr= Tin/Tkr;
else Tpr= 1;
if (Tpr == 0.0) Tpr= 0.01; 

//Предельное давление
Ppr= Pin/Pkr;
if (Ppr == 0.0) Ppr= 0.0001; 


//Коэффициент сжимаемости
Zin= 1.0 - (((0.41 / (Tpr*Tpr*Tpr)) - (0.061/Tpr)) * Ppr)-(0.04 * (Tpr*Tpr)/(Tpr*Tpr*Tpr));	


	
//Плотность на входе в нагнетатель	
if (Zin * Tin * R != 0) p_in = (Pin * 10000) / (Zin * Tin * R);
else p_in= 1;
if (p_in == 0.0) p_in= 0.0001; 

//Производительность (м3/час)
Q = (Q_35ata * p_g) / (0.00144 * p_in);
//Приведенная производительность (м3/час)	
if (N != 0) Q_pr = 	Q * (Nnom / N);
else Q_pr= 0;
//Запас по помпажу %
if (Q_min != 0) Ky = 100 * (Q_pr - Q_min) / Q_min;
else Ky = 0;

OUT[0]= Ky;
OUT[2]= Q_pr;
	
//return GEF_EXECUTION_OK;
//return(OK); // для 90-70
}
