

#include "PACRXPlc.h"
#include "dataSVK.h"
#include "math.h"

//                        Входные аналоговые сигналы
#define NGG1    			RF(1001)				//!!Частота вращения ГГ - 1-й канал(13000 об/мин )
#define NGG2    			RF(1003)				//Частота вращения ГГ - 2-й канал(13000 об/мин )
#define NST1    			RF(1005)				//Частота вращения СТ - 1-й канал(9000 об/мин)
#define NST2    			RF(1007)				//Частота вращения СТ - 2-й канал(9000 об/мин)
#define PTPK				RF(1009)				//Положение исполнительного элемента дозатора 0...100%
#define measureVNA1         RF(1011)				//Положение ВНА 1-ый датчик (-50…5 угл. град)
#define TTXH1    			RF(1015)				//Полная температура газа за ГГ на режимах 1 (0...1200 град С )
#define TTXH2    			RF(1017)				//Полная температура газа за ГГ на режимах 2 (0...1200 град С )
#define TTXH3    			RF(1019)				//Полная температура газа за ГГ на режимах 3 (0...1200 град С )
#define TTXH4    			RF(1021)				//Полная температура газа за ГГ на режимах 4 (0...1200 град С )
#define TTXH5    			RF(1023)				//Полная температура газа за ГГ на режимах 5 (0...1200 град С )
#define TTXH6    			RF(1025)				//Полная температура газа за ГГ на режимах 6 (0...1200 град С )
#define TTXH7    			RF(1027)				//Полная температура газа за ГГ на режимах 7 (0...1200 град С )
#define TTXH8    			RF(1029)				//Полная температура газа за ГГ на режимах 8 (0...1200 град С )
#define TTXH9    			RF(1031)				//Полная температура газа за ГГ на режимах 9 (0...1200 град С )
#define TTXH10    			RF(1033)				//Полная температура газа за ГГ на режимах 10 (0...1200 град С )
#define TTXH11    			RF(1035)				//Полная температура газа за ГГ на режимах 11 (0...1200 град С )
#define TTXH12    			RF(1037)				//Полная температура газа за ГГ на режимах 12 (0...1200 град С )
#define TTXG1    			RF(1039)				//Т газа за ГГ на запуске №1 (0...1200 град С )
#define TTXG2    			RF(1041)				//Т газа за ГГ на запуске №2 (0...1200 град С )

#define TTXL1    				RF(1043)				//Полная температура газа за СТ на режимах 1 (0...950 град С )
#define TTXL2    				RF(1045)				//Полная температура газа за СТ на режимах 2 (0...950 град С )
#define TTXL3    				RF(1047)				//Полная температура газа за СТ на режимах 3 (0...950 град С )
#define TTXL4    				RF(1049)				//Полная температура газа за СТ на режимах 4 (0...950 град С )
#define TTXL5    				RF(1051)				//Полная температура газа за СТ на режимах 5 (0...950 град С )
#define TTXL6    				RF(1053)				//Полная температура газа за СТ на режимах 6 (0...950 град С )
#define TTXL7    				RF(1055)				//Полная температура газа за СТ на режимах 7 (0...950 град С )
#define TTXL8    				RF(1057)				//Полная температура газа за СТ на режимах 8 (0...950 град С )
#define TTXL9    				RF(1059)				//Полная температура газа за СТ на режимах 9 (0...950 град С )
#define TTXL10    			RF(1061)				//Полная температура газа за СТ на режимах 10 (0...950 град С )
#define TTXL11    			RF(1063)				//Полная температура газа за СТ на режимах 11 (0...950 град С )
#define TTXL12    			RF(1065)				//Полная температура газа за СТ на режимах 12 (0...950 град С )

#define CT_IF    			RF(1067)				//Полная Т воздуха на входе в ГТУ			(-50...50 град С)
#define TmspKvd    			RF(1069)				//Температура масла на выходе из опоры ш/п КВД 	(-50...250 град С)
#define TmrpTvd    			RF(1071)				//Температура масла на выходе из опоры р/п ТВД 	(-50...250 град С)
#define TmopSt    			RF(1073)				//Температура масла на выходе из опоры СТ      	(-50...250 град С)
#define TmvhD    			RF(1075)				//Температура масла на входе в двигатель	  	(-50...250 град С)
#define TR_FG    			RF(1013)				//Температура топливного газа перед дозатором  	(-50...100 град С)

//#define Ttext    			RF(1015)				//Температура масла на выходе из опоры СТ

#define PTGPTK    			RF(1077)				//Давление топливного газа перед дозатором 0...4.0 Мпа
#define PmvhD    			RF(1079)				//Давление масла на входе в ГТУ 0...0.6 МПа
#define deltaPvx			RF(1081)				//Перепад между атмосферным давлением и полным давлением воздуха на входе в компрессор ГГ  0..6.3 кПа 
#define deltaPvxst			RF(1083)				//Перепад между атмосферным давлением и статическим давлением воздуха на входе в компрессор ГГ 0.. 16 кПа
#define PizbST   			RF(1085)				//Избыточное давление воздуха в разгрузочной полости СТ 0…0,6МПа
#define PgInStV    			RF(1087)				//Давление пускового газа перед СтВ 0...1.0 МПа
#define PTGVX    			RF(1089)				//Давление топливного газа на входе в ГТУ (перед СК)0...4.0 Мпа
#define PKizb 				RF(1091)				//Избыточное давление воздуха за компрессором ГГ 0…2,5МПа
#define Pvrpk    			RF(1093)				//Избыточное давление воздуха в разгрузочной полости компрессора 0…160 кПа
#define Psuf    			RF(1095)				//Давление суфлирования 0...100 кПа
#define Patm   				RF(1097)				//Давление атмосферного воздуха  80…120кПа
#define VibPp    			RF(1099)				//Виброскорость в зоне передней подвески 0…100 мм/с 
#define VibZp	   			RF(1101)				//Виброскорость в зоне задней подвески 0…100 мм/с 

													// RF (1102)...RF(1269) 	РЕЗЕРВ

//		Коэф. контуров регулирования						// RF (1271)...RF(1299) 	РЕЗЕРВ		

//		Вспомогательные								// RF (1301)...RF(1499) 	РЕЗЕРВ	

#define cycle				RF(1301)				//*Время цикла (в секундах)

//		Выходные аналоговые сигналы						// RF (1501)...RF(1599) 	РЕЗЕРВ

#define setDoz				RF(1501)				//Управление дозатором топлива 0...100%
#define setVNA				RF(1503)				//Задание на ВНА -50…5 угл. град.
// 		Расчетные (отфильтрованные) значения
#define nvd					RF(1511)				//Частота вращения ротора ГГ после обработки в СВК, 0…13000 об/мин
#define nvdNorm				RF(1513)				//Приведенная частота вращения ротора ГГ после обработки в СВК, 0…13000 об/мин
#define nst					RF(1515)				//Частота вращения ротора CТ после обработки в СВК, 0…9000 об/мин
#define Tvh					RF(1517)				//Полная температура воздуха на входе в ГТУ, -60…60 С
#define Ttzap				RF(1519)				//Температура на запусковых термопарах, –50…1000 С
#define Tt					RF(1521)				//Полная температура газа за турбиной ГГ, –50…1000 С
#define Tst					RF(1523)				//Полная температура газа за СТ, –50…1000 С
#define Tpdtg	    		RF(1525)				//Т топливного газа перед дозатором, -50...150 град С 
#define Pkvd				RF(1527)				//Давление воздуха за компрессором от СВК, 0…2.5 МПа
#define Ptg					RF(1529)				//Давление топливного газа перед СК от СВК, 0…4 МПа
#define Ptgpd				RF(1531)				//Давление топливного газа перед дозатором от СВК, 0…4 МПа
#define Pvrpkp	    		RF(1533)				//Давление воздуха в разгрузочной полости компрессора, 0…0.16 МПа
#define PvrpST	    		RF(1535)				//Давление воздуха в разгрузочной полости СТ, 0…0.16 МПа
#define Psufl_f	    		RF(1537)				//Давление суфлирования отфильтрованное, 0…0.1 МПа
#define condition			RI(1541)				//Состояние системы
#define startTimer			RF(1545)				//Таймер времени запуска
#define VibegGGTimer		RF(1551)				//Таймер времени выбега ГГ
#define VibegSTTimer		RF(1553)				//Таймер времени выбега СТ

//		Уставки ограничительных контуров и контуров регулирования	// RF (1601)...RF(1699) 	РЕЗЕРВ
#define Ttzap_ogr_ust		RF(1605)				//Уставка прекращения запуска по предельной Т газа за ГГ, К
#define Pk_ogr_ust			RF(1607)				//Уставка ограничения давления воздуха за компрессором ГГ, Мпа
#define Ngg_MG_ust			RF(1609)				//Уставка ограничения минимальной частоты вращения ротора ГГ
#define Ngg_max_ust			RF(1611)				//Уставка ограничения максимальной частоты вращения ротора ГГ
#define Nst_ogr_ust			RF(1613)				//Уставка ограничения максимальной частоты вращения ротора СТ
#define Tt_ogr_ust			RF(1615)				//Уставка ограничения температуры газа за турбиной ГГ на режимах
#define Tst_ogr_ust			RF(1617)				//Уставка ограничения температуры газа за турбиной СТ на режимах
#define Nst_max_ust			RF(1623)				//Уставка "Защита от раскрутки ротора свободной турбины"
#define CTvhNvd				RF(1665)				//Коэффициент коррекции nvd по Твх

/*
//		Модель двигателя								// RF (1701)...RF(1899) 	РЕЗЕРВ
#define NGG1    			RF(1721)				//Частота вращения ГГ - 1-й канал(13000 об/мин)
#define NGG2    			RF(1723)				//Частота вращения ГГ - 2-й канал(13000 об/мин)
#define NST1    			RF(1725)				//Частота вращения СТ - 1-й канал(9000 об/мин)
#define NST2    			RF(1727)				//Частота вращения СТ - 2-й канал(9000 об/мин)
#define PK	    			RF(1777)				//Полное давление воздуха за компрессором 0...2.5 Мпа

#define TTXH1    			RF(1729)				//Полная температура газа за ГГ на режимах 1 (0...1200 град С )
#define TTXH2    			RF(1731)				//Полная температура газа за ГГ на режимах 2 (0...1200 град С )
#define TTXH3    			RF(1733)				//Полная температура газа за ГГ на режимах 3 (0...1200 град С )
#define TTXH4    			RF(1735)				//Полная температура газа за ГГ на режимах 4 (0...1200 град С )
#define TTXH5    			RF(1737)				//Полная температура газа за ГГ на режимах 5 (0...1200 град С )
#define TTXH6    			RF(1739)				//Полная температура газа за ГГ на режимах 6 (0...1200 град С )
#define TTXH7    			RF(1741)				//Полная температура газа за ГГ на режимах 7 (0...1200 град С )
#define TTXH8    			RF(1743)				//Полная температура газа за ГГ на режимах 8 (0...1200 град С )
#define TTXH9    			RF(1745)				//Полная температура газа за ГГ на режимах 9 (0...1200 град С )
#define TTXH10    			RF(1747)				//Полная температура газа за ГГ на режимах 10 (0...1200 град С )
#define TTXH11    			RF(1749)				//Полная температура газа за ГГ на режимах 11 (0...1200 град С )
#define TTXH12    			RF(1751)				//Полная температура газа за ГГ на режимах 12 (0...1200 град С )
#define TTXG1    			RF(1779)				//Т газа за ГГ на запуске №1 (0...1200 град С )
#define TTXG2    			RF(1781)				//Т газа за ГГ на запуске №2 (0...1200 град С )

#define TTXL1    				RF(1753)				//Полная температура газа за СТ на режимах 1 (0...950 град С )
#define TTXL2    				RF(1755)				//Полная температура газа за СТ на режимах 2 (0...950 град С )
#define TTXL3    				RF(1757)				//Полная температура газа за СТ на режимах 3 (0...950 град С )
#define TTXL4    				RF(1759)				//Полная температура газа за СТ на режимах 4 (0...950 град С )
#define TTXL5    				RF(1761)				//Полная температура газа за СТ на режимах 5 (0...950 град С )
#define TTXL6    				RF(1763)				//Полная температура газа за СТ на режимах 6 (0...950 град С )
#define TTXL7    				RF(1765)				//Полная температура газа за СТ на режимах 7 (0...950 град С )
#define TTXL8    				RF(1767)				//Полная температура газа за СТ на режимах 8 (0...950 град С )
#define TTXL9    				RF(1769)				//Полная температура газа за СТ на режимах 9 (0...950 град С )
#define TTXL10    			RF(1771)				//Полная температура газа за СТ на режимах 10 (0...950 град С )
#define TTXL11    			RF(1773)				//Полная температура газа за СТ на режимах 11 (0...950 град С )
#define TTXL12    			RF(1775)				//Полная температура газа за СТ на режимах 12 (0...950 град С )
*/



//		Регулировки									// RF (1901)...RF(1999) 	РЕЗЕРВ
#define Reg_Ttzap_max_u			RF(1913)			//Регулировка предельной температуры газа на запуске
#define Reg_Ngg_Max_u			RF(1915)			//Регулировка максимальной частоты вращения ГГ
#define Reg_Ngg_MG_u			RF(1917)			//Регулировка минимальной частоты вращения ГГ
#define Reg_Pk_ogr_u			RF(1927)			//Регулировка ограничения Рк
#define Reg_Tt_ogr_u			RF(1929)			//Регулировка ограничения Т газа за турбиной ГГ на режимах
#define Reg_Nst_ogr_u			RF(1931)			//Регулировка ограничения максимальной частоты вращения СТ
#define Reg_Nst_SZTR_u			RF(1933)			//Регулировка частоты вращения ротора СТ срабатывания СЗТР

//		Входные дискретные сигналы						// RF (3001)...RF(3050) 	РЕЗЕРВ
#define KPG_ONpos			BIT_TST_M(3001)			//КПГ ТВД и КПВЗ «Открыт»
#define KPV_ONpos			BIT_TST_M(3002)			//КПВ КВД «Открыт»
#define SK_OFF_tst			BIT_TST_M(3003)			//Стопорный клапан «Закрыт»
#define StV_ON_tst	        BIT_TST_M(3004)			//СЗ СтВ «Открыта»/Готовность эл. стартера
#define dPMFS_tst	        BIT_TST_M(3005)			//Повышенный перепад давления на маслофильтре агр. БМФ-84 (на МФС-94)
#define dPBVMF_tst	        BIT_TST_M(3006)			//Повышенный перепад давления на маслофильтре агр. БМФ-84
#define VibDHigh_tst	    BIT_TST_M(3007)			//Повышенная вибрация корпуса двигателя
#define VibDMax_tst	        BIT_TST_M(3008)			//Опасная вибрация корпуса двигателя
#define CVStV_tst	        BIT_TST_M(3009)			//Высокие обороты стартера/Неиспр эл стартера
#define PoutStVMax_tst	    BIT_TST_M(3010)			//Повышенное давление газа на выходе из СтВ
#define StrFS_tst	        BIT_TST_M(3014)			//Стружка в ФС
#define StrKP_tst	        BIT_TST_M(3015)			//Стружка в масле КП
#define StrSPK_tst	        BIT_TST_M(3016)			//Стружка в линии откачки масла от ШПК
#define StrRPT_tst	        BIT_TST_M(3017)			//Стружка в линии откачки масла от РПТ
#define StrST_tst	        BIT_TST_M(3018)			//Стружка в линии откачки масла от опор СТ
#define StrMStV_tst         BIT_TST_M(3019)			//Стружка в масле СтВ
#define setDozBrk			BIT_TST_M(3039)			//Обрыв цепи управления дозатором топлива
#define setVNABrk			BIT_TST_M(3040)			//Обрыв цепи управления ВНА (ШИМ)
#define FNGG1				BIT_TST_M(3043)			//Неисправность или обрыв цепи Обороты ГГ №1                                                                        
#define FNGG1_clr 			BIT_CLR_M(3043)
#define FNGG2				BIT_TST_M(3044)			//Неисправность или обрыв цепи Обороты ГГ №2                                                                        
#define FNGG2_clr 			BIT_CLR_M(3044)
#define FNST1				BIT_TST_M(3045)			//Неисправность или обрыв цепи Обороты СТ №1                                                                        
#define FNST1_clr 			BIT_CLR_M(3045)
#define FNST2				BIT_TST_M(3046)			//Неисправность или обрыв цепи Обороты СТ №2     
#define FNST2_clr 			BIT_CLR_M(3046)

//		Обрыв аналоговых входных цепей 					// RF (3051)...RF(3150) 	РЕЗЕРВ
#define PTPKBrk				BIT_TST_M(3051)			//Обрыв цепи положения дозатора топлива
#define FPK 				BIT_TST_M(3052)			//Обрыв цепи Полное давление воздуха за компрессором   
#define PgInStVBrk			BIT_TST_M(3053)			//Обрыв цепи Давление пускового газа перед СтВ                                                                        
#define FPTGVX				BIT_TST_M(3054)			//Обрыв цепи Давление т.г. на входе ГТУ                                                                        
#define FPTGTPK				BIT_TST_M(3055)			//Обрыв цепи Давление т.г. перед дозатором                                                                        
#define PvrpkBrk			BIT_TST_M(3060)			//Обрыв цепи Давление воздуха в разгрузочной полости компрессора
#define PvrpSTBrk			BIT_TST_M(3061)			//Обрыв цепи Давление воздуха в разгрузочной полости СТ
#define PmvhDBrk			BIT_TST_M(3062)			//Обрыв цепи Давление масла на входе в двигатель
#define PsufBrk 			BIT_TST_M(3063)			//Обрыв цепи Давление суфлирования
#define VibPpBrk			BIT_TST_M(3064)			//Обрыв цепи Виброскорость в зоне передней подвески                                                                       
#define VibZpBrk			BIT_TST_M(3065)			//Обрыв цепи Виброскорость в зоне задней подвески   
#define FCT_IF				BIT_TST_M(3066)			//Обрыв цепи Полная Т воздуха на входе в ГТУ                                                                        
#define FTR_FG				BIT_TST_M(3067)			//Обрыв цепи Т т.г. перед дозатором                                                                       
#define TmvhDBrk			BIT_TST_M(3068)			//Обрыв цепи Т масла на входе в двигатель                                                                       
#define TmspKvdBrk			BIT_TST_M(3069)			//Обрыв цепи Температура масла на выходе из опоры ш/п КВД                                                                       
#define TmrpTvdBrk			BIT_TST_M(3070)			//Обрыв цепи Температура масла на выходе из опоры р/п ТВД                                                                       
#define TmopStBrk			BIT_TST_M(3071)			//Обрыв цепи Температура масла на выходе из опоры СТ     
#define FTTXG1				BIT_TST_M(3073)			//Обрыв цепи Т газа за ГГ на запуске т.1                                                                        
#define FTTXG2				BIT_TST_M(3074)			//Обрыв цепи Т газа за ГГ на запуске т.2                                                                        
#define FTTXH1    			BIT_TST_M(3075)			//Обрыв цепи температура газа за ГГ на режимах 1
#define FTTXH2    			BIT_TST_M(3076)			//Обрыв цепи температура газа за ГГ на режимах 2
#define FTTXH3    			BIT_TST_M(3077)			//Обрыв цепи температура газа за ГГ на режимах 3
#define FTTXH4    			BIT_TST_M(3078)			//Обрыв цепи температура газа за ГГ на режимах 4
#define FTTXH5    			BIT_TST_M(3079)			//Обрыв цепи температура газа за ГГ на режимах 5
#define FTTXH6    			BIT_TST_M(3080)			//Обрыв цепи температура газа за ГГ на режимах 6
#define FTTXH7    			BIT_TST_M(3081)			//Обрыв цепи температура газа за ГГ на режимах 7
#define FTTXH8    			BIT_TST_M(3082)			//Обрыв цепи температура газа за ГГ на режимах 8
#define FTTXH9    			BIT_TST_M(3083)			//Обрыв цепи температура газа за ГГ на режимах 9
#define FTTXH10    			BIT_TST_M(3084)			//Обрыв цепи температура газа за ГГ на режимах 10
#define FTTXH11    			BIT_TST_M(3075)			//Обрыв цепи температура газа за ГГ на режимах 11
#define FTTXH12    			BIT_TST_M(3086)			//Обрыв цепи температура газа за ГГ на режимах 12

#define FTTXL1    			BIT_TST_M(3087)			//Обрыв цепи температура газа за СТ на режимах 1
#define FTTXL2    			BIT_TST_M(3088)			//Обрыв цепи температура газа за СТ на режимах 2
#define FTTXL3    			BIT_TST_M(3089)			//Обрыв цепи температура газа за СТ на режимах 3
#define FTTXL4    			BIT_TST_M(3090)			//Обрыв цепи температура газа за СТ на режимах 4
#define FTTXL5    			BIT_TST_M(3091)			//Обрыв цепи температура газа за СТ на режимах 5
#define FTTXL6    			BIT_TST_M(3092)			//Обрыв цепи температура газа за СТ на режимах 6
#define FTTXL7    			BIT_TST_M(3093)			//Обрыв цепи температура газа за СТ на режимах 7
#define FTTXL8    			BIT_TST_M(3094)			//Обрыв цепи температура газа за СТ на режимах 8
#define FTTXL9    			BIT_TST_M(3095)			//Обрыв цепи температура газа за СТ на режимах 9
#define FTTXL10    			BIT_TST_M(3096)			//Обрыв цепи температура газа за СТ на режимах 10
#define FTTXL11    			BIT_TST_M(3097)			//Обрыв цепи температура газа за СТ на режимах 11
#define FTTXL12    			BIT_TST_M(3098)			//Обрыв цепи температура газа за СТ на режимах 12
#define FDBSKT1				BIT_TST_M(3251)			//Обрыв обмоток датчика ДБСКТ1

//		Обрыв цепей управления механизмами 					// RF (3151)...RF(3200) 	РЕЗЕРВ
#define setSK_ONBrk			BIT_TST_M(3151)			//Обрыв цепи открытия СК
#define KPV_ONBrk			BIT_TST_M(3152)			//Обрыв цепи открытия КПВ 
#define KPG_ONBrk			BIT_TST_M(3153)			//Обрыв цепи открытия КПГ,КПВЗ 

//		Обрыв дискретных входных цепей					// RF (3201)...RF(3400) 	РЕЗЕРВ
#define KPG_ONposBrk		BIT_TST_M(3201)			//Обрыв цепи положения КПГ,КПВЗ
#define KPV_ONposBrk		BIT_TST_M(3202)			//Обрыв цепи положения КПВ
#define SK_OFFBrk			BIT_TST_M(3203)			//Обрыв цепи положения СК
#define dPMFSBrk			BIT_TST_M(3205)			//Обрыв цепи Повышенный перепад на маслофильтре агрегата МФС-94                                                                       
#define dPBVMFBrk			BIT_TST_M(3206)			//Обрыв цепи Повышенный перепад на маслофильтре агрегата БВМФ-84    
#define VibDHighBrk			BIT_TST_M(3207)			//Обрыв цепи Повышенная вибрация двигателя(дискретный сигнал)                                                                       
#define VibDMaxBrk			BIT_TST_M(3208)			//Обрыв цепи Опасная вибрация двигателя(дискретный сигнал) 
#define CVStVBrk			BIT_TST_M(3209)			//Обрыв цепи Высокая частота вращения СтВ(ЦВ СтВ)                                                                       
#define PoutStVMaxBrk		BIT_TST_M(3210)			//Обрыв цепи Повышенное давление газа на выходе из СтВ     


//		Выходные дискретные сигналы топливного регулятора		// RF (3401)...RF(3450) 	РЕЗЕРВ
#define setSK_ON_tst		BIT_TST_M(3411)			//Открыть СК
#define KPV_ON_tst	 		BIT_TST_M(3402)			//Открыть КПВ
#define KPG_ON_tst			BIT_TST_M(3403)			//Открыть КПГ и КПВЗ
#define SZ_tst				BIT_TST_M(3404)			//*Проверка команды на стендовую заслонку
#define VZ_tst				BIT_TST_M(3405)			//*Проверка команды на воздушную заслонку

#define A_common_set		BIT_SET_M(3408)			//Установка флага "Общая авария от СВК"
#define A_common_clr		BIT_CLR_M(3408)			//Сброс флага "Общая авария от СВК"
#define A_common_tst		BIT_TST_M(3408)			//Проверка флага "Общая авария от СВК"

#define N_common_set		BIT_SET_M(3409)			//Уст-ка флага "Общий сигнал нормального останова от СВК"
#define N_common_clr		BIT_CLR_M(3409)			//Сброс флага "Общий сигнал нормального останова от СВК"
#define N_common_tst		BIT_TST_M(3409)			//Пр-ка флага "Общий сигнал нормального останова от СВК"

//		Информационные сигналы							// RF (3451)...RF(3500) 	РЕЗЕРВ
#define endHP_set			BIT_SET_M(3452)			//*Установка флага "Конец ХП"
#define endHP_clr			BIT_CLR_M(3452)			//*Сброс флага "Конец ХП"
#define endHP_tst			BIT_TST_M(3452)			//*Проверка флага "Конец ХП"

#define HP_tst				BIT_TST_M(3451)			//Проверка флага "Холодная прокрутка идет"
#define startEngine_tst		BIT_TST_M(3455)			//Проверка флага "Старт двигателя"
#define engineStarted_tst	BIT_TST_M(3456)			//Проверка флага "Двигатель работает"
#define firePresent_tst		BIT_TST_M(3459)			//Проверка флага "Розжиг"

#define GotovZap_set		BIT_SET_M(3460)			//Установка флага "Готовность к пуску"
#define GotovZap_clr		BIT_CLR_M(3460)			//Сброс флага "Готовность к пуску"
#define GotovZap_tst		BIT_TST_M(3460)			//Проверка флага "Готовность к пуску"

#define GotovHP_set			BIT_SET_M(3461)			//Уст-ка флага "Готовность к ХП"
#define GotovHP_clr			BIT_CLR_M(3461)			//Сброс флага "Готовность к ХП"
#define GotovHP_tst			BIT_TST_M(3461)			//Пр-ка флага "Готовность к ХП"

#define GotovProm_set		BIT_SET_M(3462)			//Уст-ка флага "Готовность к промывке"
#define GotovProm_clr		BIT_CLR_M(3462)			//Сброс флага "Готовность к промывке"
#define GotovProm_tst		BIT_TST_M(3462)			//Пр-ка флага "Готовность к промывке"

//		Выходные сигналы СВК							// RF (3501)...RF(3700) 	РЕЗЕРВ
#define A_NggHigh_set		BIT_SET_M(3501)			//Уст-ка флага "Аварийно-высокая частота вращения ротора ГГ"
#define A_NggHigh_clr		BIT_CLR_M(3501)			//Сброс флага "Аварийно-высокая частота вращения ротора ГГ"
#define A_NggHigh_tst		BIT_TST_M(3501)			//Пр-ка флага "Аварийно-высокая частота вращения ротора ГГ"

#define P_NstHigh_set		BIT_SET_M(3502)			//Уст-ка флага "Высокая частота вращения ротора СТ"
#define P_NstHigh_clr		BIT_CLR_M(3502)			//Сброс флага "Высокая частота вращения ротора СТ"
#define P_NstHigh_tst		BIT_TST_M(3502)			//Пр-ка флага "Высокая частота вращения ротора СТ"

#define A_NstHigh_set		BIT_SET_M(3503)			//Уст-ка флага "Аварийно-высокая частота вращения ротора СТ"
#define A_NstHigh_clr		BIT_CLR_M(3503)			//Сброс флага "Аварийно-высокая частота вращения ротора СТ"
#define A_NstHigh_tst		BIT_TST_M(3503)			//Пр-ка флага "Аварийно-высокая частота вращения ротора СТ"

#define A_Ttzap_set	    	BIT_SET_M(3504)			//Уст-ка флага "Высокая Т газа  за турбиной ГГ на запуске"
#define A_Ttzap_clr		    BIT_CLR_M(3504)			//Сброс флага "Высокая Т газа  за турбиной ГГ на запуске"
#define A_Ttzap_tst		    BIT_TST_M(3504)			//Пр-ка флага "Высокая Т газа  за турбиной ГГ на запуске"

#define P_TtHigh_set	   	BIT_SET_M(3505)			//Уст-ка флага "Повышенная температура газа  за турбиной ГГ"
#define P_TtHigh_clr	    BIT_CLR_M(3505)			//Сброс флага "Повышенная температура газа  за турбиной ГГ"
#define P_TtHigh_tst		BIT_TST_M(3505)			//Пр-ка флага "Повышенная температура газа  за турбиной ГГ"

#define N_TtHigh_set	   	BIT_SET_M(3506)			//Уст-ка флага "Высокая температура газа  за турбиной ГГ"-НО
#define N_TtHigh_clr	    BIT_CLR_M(3506)			//Сброс флага "Высокая температура газа  за турбиной ГГ"-НО
#define N_TtHigh_tst	    BIT_TST_M(3506)			//Пр-ка флага "Высокая температура газа  за турбиной ГГ"-НО

#define A_TtHigh_set	   	BIT_SET_M(3507)			//Уст-ка флага "Аварийно-высокая Т газа  за турбиной ГГ"
#define A_TtHigh_clr	    BIT_CLR_M(3507)			//Сброс флага "Аварийно-высокая Т газа  за турбиной ГГ"
#define A_TtHigh_tst	    BIT_TST_M(3507)			//Пр-ка флага "Аварийно-высокая Т газа  за турбиной ГГ"

#define P_TstHigh_set	   	BIT_SET_M(3509)					//Уст-ка флага "Повышенная температура газа  за СТ"
#define P_TstHigh_clr	  	BIT_CLR_M(3509)					//Сброс флага "Повышенная температура газа  за СТ"
#define P_TstHigh_tst		BIT_TST_M(3509)					//Пр-ка флага "Повышенная температура газа  за СТ"

#define N_TstHigh_set	   	BIT_SET_M(3510)					//Уст-ка флага "Высокая температура газа  за СТ"-НО
#define N_TstHigh_clr	   	BIT_CLR_M(3510)					//Сброс флага "Высокая температура газа  за СТ"-НО
#define N_TstHigh_tst	   	BIT_TST_M(3510)					//Пр-ка флага "Высокая температура газа  за СТ"-НО

#define A_TstHigh_set	   	BIT_SET_M(3511)					//Уст-ка флага "Аварийно-высокая Т газа  за СТ"
#define A_TstHigh_clr	   	BIT_CLR_M(3511)					//Сброс флага "Аварийно-высокая Т газа  за СТ"
#define A_TstHigh_tst	   	BIT_TST_M(3511)					//Пр-ка флага "Аварийно-высокая Т газа  за СТ"

#define P_PkvdHigh_set	   	BIT_SET_M(3512)			//Уст-ка флага "Повышенное давление воздуха за компрессором ГГ"
#define P_PkvdHigh_clr	    BIT_CLR_M(3512)			//Сброс флага "Повышенное давление воздуха за компрессором ГГ"
#define P_PkvdHigh_tst		BIT_TST_M(3512)			//Пр-ка флага "Повышенное давление воздуха за компрессором ГГ"

#define A_PtgMin_set	   	BIT_SET_M(3513)			//"Аварийно-низкое давление топливного газа перед СК"
#define A_PtgMin_clr	    BIT_CLR_M(3513)			
#define A_PtgMin_tst	    BIT_TST_M(3513)		

#define P_PtgMin_set	   	BIT_SET_M(3514)			//"Низкое давление топливного газа перед СК"
#define P_PtgMin_clr	    BIT_CLR_M(3514)			
#define P_PtgMin_tst		BIT_TST_M(3514)		

#define P_PtgLow_set	   	BIT_SET_M(3515)			//"Пониженное давление топливного газа перед СК"
#define P_PtgLow_clr	    BIT_CLR_M(3515)			
#define P_PtgLow_tst		BIT_TST_M(3515)	

#define P_PtgHigh_set	   	BIT_SET_M(3516)			//"Повышенное давление топливного газа перед СК"
#define P_PtgHigh_clr	    BIT_CLR_M(3516)			
#define P_PtgHigh_tst		BIT_TST_M(3516)		

#define N_PtgHigh_set	   	BIT_SET_M(3517)			//"Высокое давление топливного газа перед СК"
#define N_PtgHigh_clr	    BIT_CLR_M(3517)			
#define N_PtgHigh_tst		BIT_TST_M(3517)		

#define A_PtgMax_set	   	BIT_SET_M(3518)			//"Аварийно-высокое давление топливного газа перед СК"
#define A_PtgMax_clr	    BIT_CLR_M(3518)			
#define A_PtgMax_tst	    BIT_TST_M(3518)

#define P_PsufHigh_set	   	BIT_SET_M(3519)			//"Повышенное давление суфлирования"
#define P_PsufHigh_clr	    BIT_CLR_M(3519)			
#define P_PsufHigh_tst		BIT_TST_M(3519)		

#define N_PsufMax_set	   	BIT_SET_M(3520)			//"Высокое давление суфлирования"
#define N_PsufMax_clr	    BIT_CLR_M(3520)			
#define N_PsufMax_tst		BIT_TST_M(3520)		

#define P_PvrpkHigh_set  	BIT_SET_M(3521)			//"Повышенное давление воздуха в разгрузочной полости компрессора"
#define P_PvrpkHigh_clr     BIT_CLR_M(3521)			
#define P_PvrpkHigh_tst     BIT_TST_M(3521)		

#define P_UTtgKS_set    	BIT_SET_M(3522)			//"Утечка топливного газа в КС"
#define P_UTtgKS_clr        BIT_CLR_M(3522)			
#define P_UTtgKS_tst        BIT_TST_M(3522)		

#define P_UTtgKSno_set    	BIT_SET_M(3523)			//"Утечка топливного газа не контролируется"
#define P_UTtgKSno_clr      BIT_CLR_M(3523)			
#define P_UTtgKSno_tst      BIT_TST_M(3523)	

#define A_ObRaskrST_set  	BIT_SET_M(3525)			//"Обратная раскрутка ротора СТ"
#define A_ObRaskrST_clr     BIT_CLR_M(3525)			
#define A_ObRaskrST_tst     BIT_TST_M(3525)		

#define P_VibegGGMin_set   	BIT_SET_M(3526)			//"Мало время выбега ротора ГГ"
#define P_VibegGGMin_clr    BIT_CLR_M(3526)			
#define P_VibegGGMin_tst    BIT_TST_M(3526)		

#define P_VibegSTMin_set   	BIT_SET_M(3527)			//"Мало время выбега ротора СТ"
#define P_VibegSTMin_clr    BIT_CLR_M(3527)			
#define P_VibegSTMin_tst    BIT_TST_M(3527)		

#define A_DozBrkDop_set	 	BIT_SET_M(3528)			//Отказ канала измерения положения дозатора газа, обнаруженный 
#define A_DozBrkDop_clr	 	BIT_CLR_M(3528)			//допусковым контролем
#define A_DozBrkDop_tst	 	BIT_TST_M(3528)			

#define P_Nvd1BrkDop_set 	BIT_SET_M(3529)			//Уст-ка флага "Отказ 1-го канала nГГ, обнаруженный допусковым контролем" 
#define P_Nvd1BrkDop_clr 	BIT_CLR_M(3529)			//Сброс флага "Отказ 1-го канала nГГ, обнаруженный допусковым контролем"
#define P_Nvd1BrkDop_tst	BIT_TST_M(3529)			//Пр-ка флага "Отказ 1-го канала nГГ, обнаруженный допусковым контролем"

#define P_Nvd1BrkTmp_set 	BIT_SET_M(3530)			//Уст-ка флага "Отказ 1-го канала nГГ, обнаруженный темповым контролем" 
#define P_Nvd1BrkTmp_clr 	BIT_CLR_M(3530)			//Сброс флага "Отказ 1-го канала nГГ, обнаруженный темповым контролем"
#define P_Nvd1BrkTmp_tst	BIT_TST_M(3530)			//Пр-ка флага "Отказ 1-го канала nГГ, обнаруженный темповым контролем"

#define P_Nvd2BrkDop_set 	BIT_SET_M(3531)			//Уст-ка флага "Отказ 2-го канала nГГ, обнаруженный допусковым контролем" 
#define P_Nvd2BrkDop_clr 	BIT_CLR_M(3531)			//Сброс флага "Отказ 2-го канала nГГ, обнаруженный допусковым контролем"
#define P_Nvd2BrkDop_tst	BIT_TST_M(3531)			//Пр-ка флага "Отказ 2-го канала nГГ, обнаруженный допусковым контролем"

#define P_Nvd2BrkTmp_set 	BIT_SET_M(3532)			//Уст-ка флага "Отказ 2-го канала nГГ, обнаруженный темповым контролем" 
#define P_Nvd2BrkTmp_clr 	BIT_CLR_M(3532)			//Сброс флага "Отказ 2-го канала nГГ, обнаруженный темповым контролем"
#define P_Nvd2BrkTmp_tst	BIT_TST_M(3532)			//Пр-ка флага "Отказ 2-го канала nГГ, обнаруженный темповым контролем"

#define A_NvdBrk_set    	BIT_SET_M(3533)			//Уст-ка флага "Отказ всех каналов nГГ"
#define A_NvdBrk_clr		BIT_CLR_M(3533)			//Сброс флага "Отказ всех каналов nГГ"
#define A_NvdBrk_tst		BIT_TST_M(3533)			//Пр-ка флага "Отказ всех каналов nГГ"

#define A_NvdDistort_set 	BIT_SET_M(3534)			//Уст-ка флага "Отказ всех каналов nГГ, обнаруженный перекрестным контролем" 
#define A_NvdDistort_clr 	BIT_CLR_M(3534)			//Сброс флага "Отказ всех каналов nГГ, обнаруженный перекрестным контролем"
#define A_NvdDistort_tst	BIT_TST_M(3534)			//Пр-ка флага "Отказ всех каналов nГГ, обнаруженный перекрестным контролем"

#define P_Nst1BrkDop_set 	BIT_SET_M(3535)			//Уст-ка флага "Отказ 1-го канала nСТ, обнаруженный допусковым контролем" 
#define P_Nst1BrkDop_clr 	BIT_CLR_M(3535)			//Сброс флага "Отказ 1-го канала nСТ, обнаруженный допусковым контролем"
#define P_Nst1BrkDop_tst	BIT_TST_M(3535)			//Пр-ка флага "Отказ 1-го канала nСТ, обнаруженный допусковым контролем"

#define P_Nst1BrkTmp_set 	BIT_SET_M(3536)			//Уст-ка флага "Отказ 1-го канала nСТ, обнаруженный темповым контролем" 
#define P_Nst1BrkTmp_clr 	BIT_CLR_M(3536)			//Сброс флага "Отказ 1-го канала nСТ, обнаруженный темповым контролем"
#define P_Nst1BrkTmp_tst	BIT_TST_M(3536)			//Пр-ка флага "Отказ 1-го канала nСТ, обнаруженный темповым контролем"

#define P_Nst2BrkDop_set 	BIT_SET_M(3537)			//Уст-ка флага "Отказ 2-го канала nСТ, обнаруженный допусковым контролем" 
#define P_Nst2BrkDop_clr 	BIT_CLR_M(3537)			//Сброс флага "Отказ 2-го канала nСТ, обнаруженный допусковым контролем"
#define P_Nst2BrkDop_tst	BIT_TST_M(3537)			//Пр-ка флага "Отказ 2-го канала nСТ, обнаруженный допусковым контролем"

#define P_Nst2BrkTmp_set 	BIT_SET_M(3538)			//Уст-ка флага "Отказ 2-го канала nСТ, обнаруженный темповым контролем" 
#define P_Nst2BrkTmp_clr 	BIT_CLR_M(3538)			//Сброс флага "Отказ 2-го канала nСТ, обнаруженный темповым контролем"
#define P_Nst2BrkTmp_tst	BIT_TST_M(3538)			//Пр-ка флага "Отказ 2-го канала nСТ, обнаруженный темповым контролем"

#define A_NstBrk_set    	BIT_SET_M(3539)			//Уст-ка флага "Отказ всех каналов nСТ"
#define A_NstBrk_clr		BIT_CLR_M(3539)			//Сброс флага "Отказ всех каналов nСТ"
#define A_NstBrk_tst		BIT_TST_M(3539)			//Пр-ка флага "Отказ всех каналов nСТ"

#define A_NstDistort_set 	BIT_SET_M(3540)			//Уст-ка флага "Отказ всех каналов nСТ, обнаруженный перекрестным контролем" 
#define A_NstDistort_clr 	BIT_CLR_M(3540)			//Сброс флага "Отказ всех каналов nСТ, обнаруженный перекрестным контролем"
#define A_NstDistort_tst	BIT_TST_M(3540)			//Пр-ка флага "Отказ всех каналов nСТ, обнаруженный перекрестным контролем"

#define P_TvhBrkDop_set 	BIT_SET_M(3541)			//Уст-ка флага "Отказ канала Твх, обнаруженный допусковым контролем" 
#define P_TvhBrkDop_clr 	BIT_CLR_M(3541)			//Сброс флага "Отказ канала Твх, обнаруженный допусковым контролем"
#define P_TvhBrkDop_tst	    BIT_TST_M(3541)			//Пр-ка флага "Отказ канала Твх, обнаруженный допусковым контролем"

#define P_Ttzap1BrkDop_set 	BIT_SET_M(3542)			//Уст-ка флага "Отказ 1-го канала Ttzap, обнаруженный допусковым контролем" 
#define P_Ttzap1BrkDop_clr 	BIT_CLR_M(3542)			//Сброс флага "Отказ 1-го канала Ttzap, обнаруженный допусковым контролем"
#define P_Ttzap1BrkDop_tst	BIT_TST_M(3542)			//Пр-ка флага "Отказ 1-го канала Ttzap, обнаруженный допусковым контролем"

#define P_Ttzap2BrkDop_set 	BIT_SET_M(3543)			//Уст-ка флага "Отказ 2-го канала Ttzap, обнаруженный допусковым контролем" 
#define P_Ttzap2BrkDop_clr 	BIT_CLR_M(3543)			//Сброс флага "Отказ 2-го канала Ttzap, обнаруженный допусковым контролем"
#define P_Ttzap2BrkDop_tst	BIT_TST_M(3543)			//Пр-ка флага "Отказ 2-го канала Ttzap, обнаруженный допусковым контролем"

#define P_TtzapBrk_set    	BIT_SET_M(3544)			//Уст-ка флага "Отказ всех каналов Ttzap"
#define P_TtzapBrk_clr		BIT_CLR_M(3544)			//Сброс флага "Отказ всех каналов Ttzap"
#define P_TtzapBrk_tst		BIT_TST_M(3544)			//Пр-ка флага "Отказ всех каналов Ttzap"

#define P_TtzapDistort_set 	BIT_SET_M(3545)			//Уст-ка флага "Отказ всех каналов Ttzap, обнаруженный перекрестным контролем" 
#define P_TtzapDistort_clr 	BIT_CLR_M(3545)			//Сброс флага "Отказ всех каналов Ttzap, обнаруженный перекрестным контролем"
#define P_TtzapDistort_tst	BIT_TST_M(3545)			//Пр-ка флага "Отказ всех каналов Ttzap, обнаруженный перекрестным контролем"

#define P_Tt1BrkDop_set 	BIT_SET_M(3546)			//Уст-ка флага "Отказ 1-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt1BrkDop_clr 	BIT_CLR_M(3546)			//Сброс флага "Отказ 1-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt1BrkDop_tst		BIT_TST_M(3546)			//Пр-ка флага "Отказ 1-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt1BrkOtkl_set 	BIT_SET_M(3547)			//Уст-ка флага "Отказ 1-го канала Tt, по отклонению от среднего" 
#define P_Tt1BrkOtkl_clr 	BIT_CLR_M(3547)			//Сброс флага "Отказ 1-го канала Tt, по отклонению от среднего"
#define P_Tt1BrkOtkl_tst	BIT_TST_M(3547)			//Пр-ка флага "Отказ 1-го канала Tt, по отклонению от среднего"

#define P_Tt2BrkDop_set 	BIT_SET_M(3548)			//Уст-ка флага "Отказ 2-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt2BrkDop_clr 	BIT_CLR_M(3548)			//Сброс флага "Отказ 2-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt2BrkDop_tst		BIT_TST_M(3548)			//Пр-ка флага "Отказ 2-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt2BrkOtkl_set 	BIT_SET_M(3549)			//Уст-ка флага "Отказ 2-го канала Tt, по отклонению от среднего" 
#define P_Tt2BrkOtkl_clr 	BIT_CLR_M(3549)			//Сброс флага "Отказ 2-го канала Tt, по отклонению от среднего"
#define P_Tt2BrkOtkl_tst	BIT_TST_M(3549)			//Пр-ка флага "Отказ 2-го канала Tt, по отклонению от среднего"

#define P_Tt3BrkDop_set 	BIT_SET_M(3550)			//Уст-ка флага "Отказ 3-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt3BrkDop_clr 	BIT_CLR_M(3550)			//Сброс флага "Отказ 3-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt3BrkDop_tst		BIT_TST_M(3550)			//Пр-ка флага "Отказ 3-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt3BrkOtkl_set 	BIT_SET_M(3551)			//Уст-ка флага "Отказ 3-го канала Tt, по отклонению от среднего" 
#define P_Tt3BrkOtkl_clr 	BIT_CLR_M(3551)			//Сброс флага "Отказ 3-го канала Tt, по отклонению от среднего"
#define P_Tt3BrkOtkl_tst	BIT_TST_M(3551)			//Пр-ка флага "Отказ 3-го канала Tt, по отклонению от среднего"

#define P_Tt4BrkDop_set 	BIT_SET_M(3552)			//Уст-ка флага "Отказ 4-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt4BrkDop_clr 	BIT_CLR_M(3552)			//Сброс флага "Отказ 4-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt4BrkDop_tst		BIT_TST_M(3552)			//Пр-ка флага "Отказ 4-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt4BrkOtkl_set 	BIT_SET_M(3553)			//Уст-ка флага "Отказ 4-го канала Tt, по отклонению от среднего" 
#define P_Tt4BrkOtkl_clr 	BIT_CLR_M(3553)			//Сброс флага "Отказ 4-го канала Tt, по отклонению от среднего"
#define P_Tt4BrkOtkl_tst	BIT_TST_M(3553)			//Пр-ка флага "Отказ 4-го канала Tt, по отклонению от среднего"

#define P_Tt5BrkDop_set 	BIT_SET_M(3554)			//Уст-ка флага "Отказ 5-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt5BrkDop_clr 	BIT_CLR_M(3554)			//Сброс флага "Отказ 5-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt5BrkDop_tst		BIT_TST_M(3554)			//Пр-ка флага "Отказ 5-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt5BrkOtkl_set 	BIT_SET_M(3555)			//Уст-ка флага "Отказ 5-го канала Tt, по отклонению от среднего" 
#define P_Tt5BrkOtkl_clr 	BIT_CLR_M(3555)			//Сброс флага "Отказ 5-го канала Tt, по отклонению от среднего"
#define P_Tt5BrkOtkl_tst	BIT_TST_M(3555)			//Пр-ка флага "Отказ 5-го канала Tt, по отклонению от среднего"

#define P_Tt6BrkDop_set 	BIT_SET_M(3556)			//Уст-ка флага "Отказ 6-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt6BrkDop_clr 	BIT_CLR_M(3556)			//Сброс флага "Отказ 6-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt6BrkDop_tst		BIT_TST_M(3556)			//Пр-ка флага "Отказ 6-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt6BrkOtkl_set 	BIT_SET_M(3557)			//Уст-ка флага "Отказ 6-го канала Tt, по отклонению от среднего" 
#define P_Tt6BrkOtkl_clr 	BIT_CLR_M(3557)			//Сброс флага "Отказ 6-го канала Tt, по отклонению от среднего"
#define P_Tt6BrkOtkl_tst	BIT_TST_M(3557)			//Пр-ка флага "Отказ 6-го канала Tt, по отклонению от среднего"

#define P_Tt7BrkDop_set 	BIT_SET_M(3558)			//Уст-ка флага "Отказ 7-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt7BrkDop_clr 	BIT_CLR_M(3558)			//Сброс флага "Отказ 7-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt7BrkDop_tst		BIT_TST_M(3558)			//Пр-ка флага "Отказ 7-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt7BrkOtkl_set 	BIT_SET_M(3559)			//Уст-ка флага "Отказ 7-го канала Tt, по отклонению от среднего" 
#define P_Tt7BrkOtkl_clr 	BIT_CLR_M(3559)			//Сброс флага "Отказ 7-го канала Tt, по отклонению от среднего"
#define P_Tt7BrkOtkl_tst	BIT_TST_M(3559)			//Пр-ка флага "Отказ 7-го канала Tt, по отклонению от среднего"

#define P_Tt8BrkDop_set 	BIT_SET_M(3560)			//Уст-ка флага "Отказ 8-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt8BrkDop_clr 	BIT_CLR_M(3560)			//Сброс флага "Отказ 8-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt8BrkDop_tst		BIT_TST_M(3560)			//Пр-ка флага "Отказ 8-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt8BrkOtkl_set 	BIT_SET_M(3561)			//Уст-ка флага "Отказ 8-го канала Tt, по отклонению от среднего" 
#define P_Tt8BrkOtkl_clr 	BIT_CLR_M(3561)			//Сброс флага "Отказ 8-го канала Tt, по отклонению от среднего"
#define P_Tt8BrkOtkl_tst	BIT_TST_M(3561)			//Пр-ка флага "Отказ 8-го канала Tt, по отклонению от среднего"

#define P_Tt9BrkDop_set 	BIT_SET_M(3562)			//Уст-ка флага "Отказ 9-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt9BrkDop_clr 	BIT_CLR_M(3562)			//Сброс флага "Отказ 9-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt9BrkDop_tst		BIT_TST_M(3562)			//Пр-ка флага "Отказ 9-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt9BrkOtkl_set 	BIT_SET_M(3563)			//Уст-ка флага "Отказ 9-го канала Tt, по отклонению от среднего" 
#define P_Tt9BrkOtkl_clr 	BIT_CLR_M(3563)			//Сброс флага "Отказ 9-го канала Tt, по отклонению от среднего"
#define P_Tt9BrkOtkl_tst	BIT_TST_M(3563)			//Пр-ка флага "Отказ 9-го канала Tt, по отклонению от среднего"

#define P_Tt10BrkDop_set 	BIT_SET_M(3564)			//Уст-ка флага "Отказ 10-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt10BrkDop_clr 	BIT_CLR_M(3564)			//Сброс флага "Отказ 10-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt10BrkDop_tst	BIT_TST_M(3564)			//Пр-ка флага "Отказ 10-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt10BrkOtkl_set 	BIT_SET_M(3565)			//Уст-ка флага "Отказ 10-го канала Tt, по отклонению от среднего" 
#define P_Tt10BrkOtkl_clr 	BIT_CLR_M(3565)			//Сброс флага "Отказ 10-го канала Tt, по отклонению от среднего"
#define P_Tt10BrkOtkl_tst	BIT_TST_M(3565)			//Пр-ка флага "Отказ 10-го канала Tt, по отклонению от среднего"

#define P_Tt11BrkDop_set 	BIT_SET_M(3566)			//Уст-ка флага "Отказ 11-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt11BrkDop_clr 	BIT_CLR_M(3566)			//Сброс флага "Отказ 11-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt11BrkDop_tst	BIT_TST_M(3566)			//Пр-ка флага "Отказ 11-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt11BrkOtkl_set 	BIT_SET_M(3567)			//Уст-ка флага "Отказ 11-го канала Tt, по отклонению от среднего" 
#define P_Tt11BrkOtkl_clr 	BIT_CLR_M(3567)			//Сброс флага "Отказ 11-2го канала Tt, по отклонению от среднего"
#define P_Tt11BrkOtkl_tst	BIT_TST_M(3567)			//Пр-ка флага "Отказ 11-го канала Tt, по отклонению от среднего"

#define P_Tt12BrkDop_set 	BIT_SET_M(3568)			//Уст-ка флага "Отказ 12-го канала Tt, обнаруженный допусковым контролем" 
#define P_Tt12BrkDop_clr 	BIT_CLR_M(3568)			//Сброс флага "Отказ 12-го канала Tt, обнаруженный допусковым контролем"
#define P_Tt12BrkDop_tst	BIT_TST_M(3568)			//Пр-ка флага "Отказ 12-го канала Tt, обнаруженный допусковым контролем"

#define P_Tt12BrkOtkl_set 	BIT_SET_M(3569)			//Уст-ка флага "Отказ 12-го канала Tt, по отклонению от среднего" 
#define P_Tt12BrkOtkl_clr 	BIT_CLR_M(3569)			//Сброс флага "Отказ 12-го канала Tt, по отклонению от среднего"
#define P_Tt12BrkOtkl_tst	BIT_TST_M(3569)			//Пр-ка флага "Отказ 12-го канала Tt, по отклонению от среднего"

#define N_TtBrk_set			BIT_SET_M(3570)			//Уст-ка флага "Отказ всех каналов измерения Tt" 
#define N_TtBrk_clr			BIT_CLR_M(3570)			//Сброс флага "Отказ всех каналов измерения Tt"
#define N_TtBrk_tst			BIT_TST_M(3570)			//Пр-ка флага "Отказ всех каналов измерения Tt"

#define A_TtTtzapBrk_set 	BIT_SET_M(3571)			//Уст-ка флага "Одновременный  отказ каналов измерения Тt и Тtзап" 
#define A_TtTtzapBrk_clr 	BIT_CLR_M(3571)			//Сброс флага "Одновременный  отказ каналов измерения Тt и Тtзап"
#define A_TtTtzapBrk_tst	BIT_TST_M(3571)			//Пр-ка флага "Одновременный  отказ каналов измерения Тt и Тtзап"

#define P_Tst1BrkDop_set 	BIT_SET_M(3572)			//Уст-ка флага "Отказ 1-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst1BrkDop_clr 	BIT_CLR_M(3572)			//Сброс флага "Отказ 1-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst1BrkDop_tst	BIT_TST_M(3572)			//Пр-ка флага "Отказ 1-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst1BrkOtkl_set 	BIT_SET_M(3573)			//Уст-ка флага "Отказ 1-го канала Tst, по отклонению от среднего" 
#define P_Tst1BrkOtkl_clr 	BIT_CLR_M(3573)			//Сброс флага "Отказ 1-го канала Tst, по отклонению от среднего"
#define P_Tst1BrkOtkl_tst	BIT_TST_M(3573)			//Пр-ка флага "Отказ 1-го канала Tst, по отклонению от среднего"

#define P_Tst2BrkDop_set 	BIT_SET_M(3574)			//Уст-ка флага "Отказ 2-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst2BrkDop_clr 	BIT_CLR_M(3574)			//Сброс флага "Отказ 2-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst2BrkDop_tst	BIT_TST_M(3574)			//Пр-ка флага "Отказ 2-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst2BrkOtkl_set 	BIT_SET_M(3575)			//Уст-ка флага "Отказ 2-го канала Tst, по отклонению от среднего" 
#define P_Tst2BrkOtkl_clr 	BIT_CLR_M(3575)			//Сброс флага "Отказ 2-го канала Tst, по отклонению от среднего"
#define P_Tst2BrkOtkl_tst	BIT_TST_M(3575)			//Пр-ка флага "Отказ 2-го канала Tst, по отклонению от среднего"

#define P_Tst3BrkDop_set 	BIT_SET_M(3576)			//Уст-ка флага "Отказ 3-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst3BrkDop_clr 	BIT_CLR_M(3576)			//Сброс флага "Отказ 3-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst3BrkDop_tst	BIT_TST_M(3576)			//Пр-ка флага "Отказ 3-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst3BrkOtkl_set 	BIT_SET_M(3577)			//Уст-ка флага "Отказ 3-го канала Tst, по отклонению от среднего" 
#define P_Tst3BrkOtkl_clr 	BIT_CLR_M(3577)			//Сброс флага "Отказ 3-го канала Tst, по отклонению от среднего"
#define P_Tst3BrkOtkl_tst	BIT_TST_M(3577)			//Пр-ка флага "Отказ 3-го канала Tst, по отклонению от среднего"

#define P_Tst4BrkDop_set 	BIT_SET_M(3578)			//Уст-ка флага "Отказ 4-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst4BrkDop_clr 	BIT_CLR_M(3578)			//Сброс флага "Отказ 4-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst4BrkDop_tst	BIT_TST_M(3578)			//Пр-ка флага "Отказ 4-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst4BrkOtkl_set 	BIT_SET_M(3579)			//Уст-ка флага "Отказ 4-го канала Tst, по отклонению от среднего" 
#define P_Tst4BrkOtkl_clr 	BIT_CLR_M(3579)			//Сброс флага "Отказ 4-го канала Tst, по отклонению от среднего"
#define P_Tst4BrkOtkl_tst	BIT_TST_M(3579)			//Пр-ка флага "Отказ 4-го канала Tst, по отклонению от среднего"

#define P_Tst5BrkDop_set 	BIT_SET_M(3580)			//Уст-ка флага "Отказ 5-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst5BrkDop_clr 	BIT_CLR_M(3580)			//Сброс флага "Отказ 5-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst5BrkDop_tst	BIT_TST_M(3580)			//Пр-ка флага "Отказ 5-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst5BrkOtkl_set 	BIT_SET_M(3581)			//Уст-ка флага "Отказ 5-го канала Tst, по отклонению от среднего" 
#define P_Tst5BrkOtkl_clr 	BIT_CLR_M(3581)			//Сброс флага "Отказ 5-го канала Tst, по отклонению от среднего"
#define P_Tst5BrkOtkl_tst	BIT_TST_M(3581)			//Пр-ка флага "Отказ 5-го канала Tst, по отклонению от среднего"

#define P_Tst6BrkDop_set 	BIT_SET_M(3582)			//Уст-ка флага "Отказ 6-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst6BrkDop_clr 	BIT_CLR_M(3582)			//Сброс флага "Отказ 6-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst6BrkDop_tst	BIT_TST_M(3582)			//Пр-ка флага "Отказ 6-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst6BrkOtkl_set 	BIT_SET_M(3583)			//Уст-ка флага "Отказ 6-го канала Tst, по отклонению от среднего" 
#define P_Tst6BrkOtkl_clr 	BIT_CLR_M(3583)			//Сброс флага "Отказ 6-го канала Tst, по отклонению от среднего"
#define P_Tst6BrkOtkl_tst	BIT_TST_M(3583)			//Пр-ка флага "Отказ 6-го канала Tst, по отклонению от среднего"

#define P_Tst7BrkDop_set 	BIT_SET_M(3584)			//Уст-ка флага "Отказ 7-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst7BrkDop_clr 	BIT_CLR_M(3584)			//Сброс флага "Отказ 7-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst7BrkDop_tst	BIT_TST_M(3584)			//Пр-ка флага "Отказ 7-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst7BrkOtkl_set 	BIT_SET_M(3585)			//Уст-ка флага "Отказ 7-го канала Tst, по отклонению от среднего" 
#define P_Tst7BrkOtkl_clr 	BIT_CLR_M(3585)			//Сброс флага "Отказ 7-го канала Tst, по отклонению от среднего"
#define P_Tst7BrkOtkl_tst	BIT_TST_M(3585)			//Пр-ка флага "Отказ 7-го канала Tst, по отклонению от среднего"

#define P_Tst8BrkDop_set 	BIT_SET_M(3586)			//Уст-ка флага "Отказ 8-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst8BrkDop_clr 	BIT_CLR_M(3586)			//Сброс флага "Отказ 8-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst8BrkDop_tst	BIT_TST_M(3586)			//Пр-ка флага "Отказ 8-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst8BrkOtkl_set 	BIT_SET_M(3587)			//Уст-ка флага "Отказ 8-го канала Tst, по отклонению от среднего" 
#define P_Tst8BrkOtkl_clr 	BIT_CLR_M(3587)			//Сброс флага "Отказ 8-го канала Tst, по отклонению от среднего"
#define P_Tst8BrkOtkl_tst	BIT_TST_M(3587)			//Пр-ка флага "Отказ 8-го канала Tst, по отклонению от среднего"

#define P_Tst9BrkDop_set 	BIT_SET_M(3588)			//Уст-ка флага "Отказ 9-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst9BrkDop_clr 	BIT_CLR_M(3588)			//Сброс флага "Отказ 9-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst9BrkDop_tst	BIT_TST_M(3588)			//Пр-ка флага "Отказ 9-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst9BrkOtkl_set 	BIT_SET_M(3589)			//Уст-ка флага "Отказ 9-го канала Tst, по отклонению от среднего" 
#define P_Tst9BrkOtkl_clr 	BIT_CLR_M(3589)			//Сброс флага "Отказ 9-го канала Tst, по отклонению от среднего"
#define P_Tst9BrkOtkl_tst	BIT_TST_M(3589)			//Пр-ка флага "Отказ 9-го канала Tst, по отклонению от среднего"

#define P_Tst10BrkDop_set 	BIT_SET_M(3590)			//Уст-ка флага "Отказ 10-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst10BrkDop_clr 	BIT_CLR_M(3590)			//Сброс флага "Отказ 10-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst10BrkDop_tst	BIT_TST_M(3590)			//Пр-ка флага "Отказ 10-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst10BrkOtkl_set 	BIT_SET_M(3591)			//Уст-ка флага "Отказ 10-го канала Tst, по отклонению от среднего" 
#define P_Tst10BrkOtkl_clr 	BIT_CLR_M(3591)			//Сброс флага "Отказ 10-го канала Tst, по отклонению от среднего"
#define P_Tst10BrkOtkl_tst	BIT_TST_M(3591)			//Пр-ка флага "Отказ 10-го канала Tst, по отклонению от среднего"

#define P_Tst11BrkDop_set 	BIT_SET_M(3592)			//Уст-ка флага "Отказ 11-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst11BrkDop_clr 	BIT_CLR_M(3592)			//Сброс флага "Отказ 11-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst11BrkDop_tst	BIT_TST_M(3592)			//Пр-ка флага "Отказ 11-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst11BrkOtkl_set 	BIT_SET_M(3593)			//Уст-ка флага "Отказ 11-го канала Tst, по отклонению от среднего" 
#define P_Tst11BrkOtkl_clr 	BIT_CLR_M(3593)			//Сброс флага "Отказ 11-го канала Tst, по отклонению от среднего"
#define P_Tst11BrkOtkl_tst	BIT_TST_M(3593)			//Пр-ка флага "Отказ 11-го канала Tst, по отклонению от среднего"

#define P_Tst12BrkDop_set 	BIT_SET_M(3594)			//Уст-ка флага "Отказ 12-го канала Tst, обнаруженный допусковым контролем" 
#define P_Tst12BrkDop_clr 	BIT_CLR_M(3594)			//Сброс флага "Отказ 12-го канала Tst, обнаруженный допусковым контролем"
#define P_Tst12BrkDop_tst	BIT_TST_M(3594)			//Пр-ка флага "Отказ 12-го канала Tst, обнаруженный допусковым контролем"

#define P_Tst12BrkOtkl_set 	BIT_SET_M(3595)			//Уст-ка флага "Отказ 12-го канала Tst, по отклонению от среднего" 
#define P_Tst12BrkOtkl_clr 	BIT_CLR_M(3595)			//Сброс флага "Отказ 12-го канала Tst, по отклонению от среднего"
#define P_Tst12BrkOtkl_tst	BIT_TST_M(3595)			//Пр-ка флага "Отказ 12-го канала Tst, по отклонению от среднего"

#define N_TstBrk_set		BIT_SET_M(3596)			//Уст-ка флага "Отказ всех каналов измерения Tst" 
#define N_TstBrk_clr		BIT_CLR_M(3596)			//Сброс флага "Отказ всех каналов измерения Tst"
#define N_TstBrk_tst		BIT_TST_M(3596)			//Пр-ка флага "Отказ всех каналов измерения Tst"

#define P_TpdtgDop_set		BIT_SET_M(3597)			//Уст-ка флага "Отказ канала Ттгпд, обнаруженный допусковым контролем" 
#define P_TpdtgDop_clr		BIT_SET_M(3597)			//Уст-ка флага "Отказ канала Ттгпд, обнаруженный допусковым контролем" 
#define P_TpdtgDop_tst		BIT_SET_M(3597)			//Уст-ка флага "Отказ канала Ттгпд, обнаруженный допусковым контролем" 

#define P_PkBrkDop_set 		BIT_SET_M(3598)			//Уст-ка флага "Отказ канала Рк, обнаруженный допусковым контролем" 
#define P_PkBrkDop_clr 		BIT_CLR_M(3598)			//Сброс флага "Отказ канала Рк, обнаруженный допусковым контролем"
#define P_PkBrkDop_tst		BIT_TST_M(3598)			//Пр-ка флага "Отказ канала Рк, обнаруженный допусковым контролем"

#define P_PtgPdBrkDop_set 	BIT_SET_M(3599)			//Уст-ка флага "Отказ канала Ртгпд, обнаруженный допусковым контролем" 
#define P_PtgPdBrkDop_clr 	BIT_CLR_M(3599)			//Сброс флага "Отказ канала Ртгпд, обнаруженный допусковым контролем"
#define P_PtgPdBrkDop_tst	BIT_TST_M(3599)			//Пр-ка флага "Отказ канала Ртгпд, обнаруженный допусковым контролем"

#define P_PtgSkBrkDop_set	BIT_SET_M(3600)			//Уст-ка флага "Отказ канала Ртгск, обнаруженный допусковым контролем" 
#define P_PtgSkBrkDop_clr	BIT_CLR_M(3600)			//Сброс флага "Отказ канала Ртгск, обнаруженный допусковым контролем"
#define P_PtgSkBrkDop_tst	BIT_TST_M(3600)			//Пр-ка флага "Отказ канала Ртгск, обнаруженный допусковым контролем"

#define A_VNABrkDop_set	 	BIT_SET_M(3601)			//Отказ канала измерения положения ВНА, обнаруженный допусковым контролем 
#define A_VNABrkDop_clr	 	BIT_CLR_M(3601)			
#define A_VNABrkDop_tst	 	BIT_TST_M(3601)			

#define A_DozBrk_set	 	BIT_SET_M(3602)			//Отказ дозатора газа, обнаруженный функциональным контролем по
#define A_DozBrk_clr	 	BIT_CLR_M(3602)			//рассогласованию задания и положения
#define A_DozBrk_tst	 	BIT_TST_M(3602)			

#define A_VNABrk_Pos_set	BIT_SET_M(3603)			//Неисправность ИМ ВНА, обнаруженная функциональным контролем по
#define A_VNABrk_Pos_clr	BIT_CLR_M(3603)			//рассогласованию задания и положения > 20 град
#define A_VNABrk_Pos_tst	BIT_TST_M(3603)			

#define P_KPVBrk_set	 	BIT_SET_M(3604)			//Отказ гидравлико-механической части канала управления ИМ КПВ 
#define P_KPVBrk_clr	 	BIT_CLR_M(3604)			//или отказ сигнализатора давления
#define P_KPVBrk_tst	 	BIT_TST_M(3604)	

#define P_KPGBrk_set	 	BIT_SET_M(3605)			//Отказ гидравлико-механической части канала управления ИМ КПГ,КПВЗ 
#define P_KPGBrk_clr	 	BIT_CLR_M(3605)			//или отказ сигнализатора давления
#define P_KPGBrk_tst	 	BIT_TST_M(3605)		

#define A_SKBrk_set		 	BIT_SET_M(3606)			//Отказ пневмо-механической части канала управления СК 
#define A_SKBrk_clr		 	BIT_CLR_M(3606)			//или отказ датчика положения
#define A_SKBrk_tst	 		BIT_TST_M(3606)		

#define P_TmvhDmin_set	   	BIT_SET_M(3607)			//"Пониженная температура масла на входе в двигатель"
#define P_TmvhDmin_clr	    BIT_CLR_M(3607)			
#define P_TmvhDmin_tst		BIT_TST_M(3607)		

#define P_TmvhDmax_set	   	BIT_SET_M(3608)			//"Повышенная температура масла на входе в двигатель"
#define P_TmvhDmax_clr	    BIT_CLR_M(3608)			
#define P_TmvhDmax_tst		BIT_TST_M(3608)		

#define A_PgInStVmin_set   	BIT_SET_M(3609)			//"Низкое давление пускового газа перед СтВ"
#define A_PgInStVmin_clr    BIT_CLR_M(3609)			
#define A_PgInStVmin_tst	BIT_TST_M(3609)		

#define A_PgInStVmax_set   	BIT_SET_M(3610)			//"Высокое давление пускового газа перед СтВ"
#define A_PgInStVmax_clr    BIT_CLR_M(3610)			
#define A_PgInStVmax_tst	BIT_TST_M(3610)		

#define P_TtgMin_set	   	BIT_SET_M(3611)			//"Пониженная температура топливного газа перед ДГ"
#define P_TtgMin_clr	    BIT_CLR_M(3611)			
#define P_TtgMin_tst		BIT_TST_M(3611)		

#define P_TtgMax_set	 	BIT_SET_M(3612)			//"Повышенная температура топливного газа перед ДГ"
#define P_TtgMax_clr		BIT_CLR_M(3612)			
#define P_TtgMax_tst		BIT_TST_M(3612)		

#define A_PmvhDno_set	   	BIT_SET_M(3613)			//"Нет давления масла на входе в двигатель"
#define A_PmvhDno_clr	    BIT_CLR_M(3613)			
#define A_PmvhDno_tst		BIT_TST_M(3613)		
	
#define P_PmvhDlow_set	   	BIT_SET_M(3614)			//"Пониженное давление масла на входе в двигатель"
#define P_PmvhDlow_clr	    BIT_CLR_M(3614)			
#define P_PmvhDlow_tst		BIT_TST_M(3614)		

#define N_PmvhDmin_set	   	BIT_SET_M(3615)			//"Низкое давление масла на входе в двигатель"
#define N_PmvhDmin_clr	    BIT_CLR_M(3615)			
#define N_PmvhDmin_tst		BIT_TST_M(3615)		

#define A_PmvhDmin_set	   	BIT_SET_M(3616)			//"Аварийно-низкое давление масла на входе в двигатель"
#define A_PmvhDmin_clr	    BIT_CLR_M(3616)			
#define A_PmvhDmin_tst		BIT_TST_M(3616)		

#define P_TmspKvdHigh_set 	BIT_SET_M(3617)			//"Повышенная температура масла на выходе из опоры ш/п КВД"
#define P_TmspKvdHigh_clr   BIT_CLR_M(3617)			
#define P_TmspKvdHigh_tst	BIT_TST_M(3617)		

#define N_TmspKvdMax_set   	BIT_SET_M(3618)			//"Высокая температура масла на выходе из опоры ш/п КВД"
#define N_TmspKvdMax_clr    BIT_CLR_M(3618)			
#define N_TmspKvdMax_tst	BIT_TST_M(3618)		

#define A_TmspKvdMax_set   	BIT_SET_M(3619)			//"Аварийно-высокая температура масла на выходе из опоры ш/п КВД"
#define A_TmspKvdMax_clr    BIT_CLR_M(3619)			
#define A_TmspKvdMax_tst	BIT_TST_M(3619)	

#define P_TmrpTvdHigh_set 	BIT_SET_M(3620)			//"Повышенная температура масла на выходе из опоры р/п ТВД"
#define P_TmrpTvdHigh_clr   BIT_CLR_M(3620)			
#define P_TmrpTvdHigh_tst	BIT_TST_M(3620)		

#define N_TmrpTvdMax_set   	BIT_SET_M(3621)			//"Высокая температура масла на выходе из опоры р/п ТВД"
#define N_TmrpTvdMax_clr    BIT_CLR_M(3621)			
#define N_TmrpTvdMax_tst	BIT_TST_M(3621)		

#define A_TmrpTvdMax_set   	BIT_SET_M(3622)			//"Аварийно-высокая температура масла на выходе из опоры р/п ТВД"
#define A_TmrpTvdMax_clr    BIT_CLR_M(3622)			
#define A_TmrpTvdMax_tst	BIT_TST_M(3622)	

#define P_TmopStHigh_set 	BIT_SET_M(3623)			//"Повышенная температура масла на выходе из опор СТ"
#define P_TmopStHigh_clr    BIT_CLR_M(3623)			
#define P_TmopStHigh_tst	BIT_TST_M(3623)		

#define N_TmopStMax_set   	BIT_SET_M(3624)			//"Высокая температура масла на выходе из опор СТ"
#define N_TmopStMax_clr     BIT_CLR_M(3624)			
#define N_TmopStMax_tst	    BIT_TST_M(3624)		

#define A_TmopStMax_set   	BIT_SET_M(3625)			//"Аварийно-высокая температура масла на выходе из опор СТ"
#define A_TmopStMax_clr     BIT_CLR_M(3625)			
#define A_TmopStMax_tst 	BIT_TST_M(3625)

#define P_VibPpHigh_set  	BIT_SET_M(3626)			//"Повышенная вибрация  двигателя в зоне ПП"
#define P_VibPpHigh_clr     BIT_CLR_M(3626)			
#define P_VibPpHigh_tst	    BIT_TST_M(3626)		

#define N_VibPpMax_set   	BIT_SET_M(3627)			//"Опасная вибрация двигателя в зоне ПП"
#define N_VibPpMax_clr      BIT_CLR_M(3627)			
#define N_VibPpMax_tst	    BIT_TST_M(3627)	

#define P_VibZpHigh_set  	BIT_SET_M(3628)			//"Повышенная вибрация  двигателя в зоне ЗП"
#define P_VibZpHigh_clr     BIT_CLR_M(3628)			
#define P_VibZpHigh_tst	    BIT_TST_M(3628)		

#define N_VibZpMax_set   	BIT_SET_M(3629)			//"Опасная вибрация двигателя в зоне ЗП"
#define N_VibZpMax_clr      BIT_CLR_M(3629)			
#define N_VibZpMax_tst	    BIT_TST_M(3629)

#define P_VibDHigh_set  	BIT_SET_M(3630)			//"Повышенная вибрация двигателя"
#define P_VibDHigh_clr      BIT_CLR_M(3630)			
#define P_VibDHigh_tst	    BIT_TST_M(3630)		

#define N_VibDMax_set   	BIT_SET_M(3631)			//"Опасная вибрация двигателя"
#define N_VibDMax_clr       BIT_CLR_M(3631)			
#define N_VibDMax_tst	    BIT_TST_M(3631)	

#define A_RateVibPpMax_set 	BIT_SET_M(3632)			//"Высокий рост вибрации двигателя в зоне ПП"
#define A_RateVibPpMax_clr  BIT_CLR_M(3632)			
#define A_RateVibPpMax_tst 	BIT_TST_M(3632)		

#define A_RateVibZpMax_set 	BIT_SET_M(3633)			//"Высокий рост вибрации двигателя в зоне ЗП"
#define A_RateVibZpMax_clr  BIT_CLR_M(3633)			
#define A_RateVibZpMax_tst 	BIT_TST_M(3633)		

#define P_osSTHigh_set  	BIT_SET_M(3634)			//"Повышенная осевая сила ротора СТ"
#define P_osSTHigh_clr      BIT_CLR_M(3634)			
#define P_osSTHigh_tst	    BIT_TST_M(3634)		

#define A_CVStVMax_set  	BIT_SET_M(3635)			//"Высокие обороты стартера"
#define A_CVStVMax_clr      BIT_CLR_M(3635)			
#define A_CVStVMax_tst	    BIT_TST_M(3635)		

#define A_StrMStV_set   	BIT_SET_M(3636)			//"Стружка в масле СтВ"
#define A_StrMStV_clr       BIT_CLR_M(3636)			
#define A_StrMStV_tst	    BIT_TST_M(3636)		

#define A_PoutStVMax_set   	BIT_SET_M(3637)			//"Давление газа за СтВ повышенное"
#define A_PoutStVMax_clr    BIT_CLR_M(3637)			
#define A_PoutStVMax_tst    BIT_TST_M(3637)		

#define N_StrKP_set     	BIT_SET_M(3638)			//"Стружка в масле КП"
#define N_StrKP_clr         BIT_CLR_M(3638)			
#define N_StrKP_tst         BIT_TST_M(3638)		

#define N_StrSPK_set     	BIT_SET_M(3639)			//"Стружка в линии откачки масла от ШПК"
#define N_StrSPK_clr        BIT_CLR_M(3639)			
#define N_StrSPK_tst        BIT_TST_M(3639)		

#define N_StrRPT_set     	BIT_SET_M(3640)			//"Стружка в линии откачки масла от РПТ"
#define N_StrRPT_clr        BIT_CLR_M(3640)			
#define N_StrRPT_tst        BIT_TST_M(3640)	

#define N_StrST_set     	BIT_SET_M(3641)			//"Стружка в линии откачки масла от опор СТ"
#define N_StrST_clr         BIT_CLR_M(3641)			
#define N_StrST_tst         BIT_TST_M(3641)		

#define N_StrFS_set     	BIT_SET_M(3642)			//"Стружка в ФС"
#define N_StrFS_clr         BIT_CLR_M(3642)			
#define N_StrFS_tst         BIT_TST_M(3642)		

#define P_dPMFSHigh_set    	BIT_SET_M(3643)			//"Повышенный перепад на маслофильтре агрегата МФС-94"
#define P_dPMFSHigh_clr     BIT_CLR_M(3643)			
#define P_dPMFSHigh_tst     BIT_TST_M(3643)		

#define P_dPBVMFHigh_set   	BIT_SET_M(3644)			//"Повышенный перепад на маслофильтре агрегата БВМФ-84"
#define P_dPBVMFHigh_clr    BIT_CLR_M(3644)			
#define P_dPBVMFHigh_tst    BIT_TST_M(3644)	

#define P_QmBGtuMax_set  	BIT_SET_M(3646)			//"Полный маслобак ГТУ"
#define P_QmBGtuMax_clr     BIT_CLR_M(3646)			
#define P_QmBGtuMax_tst     BIT_TST_M(3646)		

#define P_QmBGtu_set     	BIT_SET_M(3647)			//"Эксплуатационный резерв масла в маслобаке ГТУ"
#define P_QmBGtu_clr        BIT_CLR_M(3647)			
#define P_QmBGtu_tst        BIT_TST_M(3647)		

#define P_QmBGtuMin_set  	BIT_SET_M(3648)			//"Минимальный уровень масла в маслобаке ГТУ"
#define P_QmBGtuMin_clr     BIT_CLR_M(3648)			
#define P_QmBGtuMin_tst     BIT_TST_M(3648)		

#define P_qmGtuHigh_set  	BIT_SET_M(3649)			//"Повышенный расход масла"
#define P_qmGtuHigh_clr     BIT_CLR_M(3649)			
#define P_qmGtuHigh_tst     BIT_TST_M(3649)		
/*
//Контроль работы БЗД
#define P_controlBZD_set  	BIT_SET_M(3650)					//"Неисправность БЗД"
#define P_controlBZD_clr    BIT_CLR_M(3650)			
#define P_controlBZD_tst    BIT_TST_M(3650)		
*/
#define A_aoBZD_set       	BIT_SET_M(3651)			//"АО от БЗД"
#define A_aoBZD_clr         BIT_CLR_M(3651)			
#define A_aoBZD_tst         BIT_TST_M(3651)		

#define A_KPVIMBrk_set	 	BIT_SET_M(3652)			//Отказ электрической части канала управления КПВ 
#define A_KPVIMBrk_clr	 	BIT_CLR_M(3652)			
#define A_KPVIMBrk_tst	 	BIT_TST_M(3652)	

#define A_KPGIMBrk_set	 	BIT_SET_M(3653)			//Отказ электрической части канала управления КПГ,КПВЗ 
#define A_KPGIMBrk_clr	 	BIT_CLR_M(3653)			
#define A_KPGIMBrk_tst	 	BIT_TST_M(3653)	

#define A_srmeasureVNA_set 	BIT_SET_M(3654)			//Рассогласовния датчиков ДБСКТ
#define A_srmeasureVNA_clr 	BIT_CLR_M(3654)				
#define A_srmeasureVNA_tst 	BIT_TST_M(3654)	

#define N_deltaPvxMax_set	   	BIT_SET_M(3655)		//"Входной тракт двигателя засорен"
#define N_deltaPvxMax_clr	    BIT_CLR_M(3655)			
#define N_deltaPvxMax_tst		BIT_TST_M(3655)			

#define P_deltaPvxHigh_set	   	BIT_SET_M(3656)		//"Повышенный перепад давления на входе в двигатель"
#define P_deltaPvxHigh_clr	    BIT_CLR_M(3656)			
#define P_deltaPvxHigh_tst		BIT_TST_M(3656)	

#define A_NggLow_set			BIT_SET_M(3657)		//Уст-ка флага "Аварийно-низкая частота вращения ротора ГГ"
#define A_NggLow_clr			BIT_CLR_M(3657)		//Сброс флага "Аварийно-низкая частота вращения ротора ГГ"
#define A_NggLow_tst			BIT_TST_M(3657)		//Пр-ка флага "Аварийно-низкая частота вращения ротора ГГ"

#define A_Pompaz_set		BIT_SET_M(3658)			//Уст-ка флага "Аварийный останов по сигналу "Помпаж""
#define A_Pompaz_clr		BIT_CLR_M(3658)			//Сброс флага "Аварийный останов по сигналу "Помпаж""
#define A_Pompaz_tst		BIT_TST_M(3658)			//Пр-ка флага "Аварийный останов по сигналу "Помпаж""

#define A_Pogas_set			BIT_SET_M(3659)			//Уст-ка флага "Аварийный останов по сигналу "Погасание КС на запуске""
#define A_Pogas_clr			BIT_CLR_M(3659)			//Сброс флага "Аварийный останов по сигналу "Погасание КС на запуске""
#define A_Pogas_tst			BIT_TST_M(3659)			//Пр-ка флага "Аварийный останов по сигналу "Погасание КС на запуске""

#define A_VNABrk_Neg_set	BIT_SET_M(3660)			//Неисправность ИМ ВНА, обнаруженная функциональным контролем по
#define A_VNABrk_Neg_clr	BIT_CLR_M(3660)			//рассогласованию задания и положения < -7 град.
#define A_VNABrk_Neg_tst	BIT_TST_M(3660)			

#define A_PgInStVmin_proval_set   	BIT_SET_M(3661)			//"Низкое давление пускового газа перед СтВ (Провал давления < 0.16 МПа)"
#define A_PgInStVmin_proval_clr     BIT_CLR_M(3661)			
#define A_PgInStVmin_proval_tst		BIT_TST_M(3661)		

#define A_STbrk_set   		BIT_SET_M(3524)			//"Неисправность СТ"
#define A_STbrk_clr     	BIT_CLR_M(3524)			
#define A_STbrk_tst			BIT_TST_M(3524)	


//		Управляющие команды							// RF (3701)...RF(3800) 	РЕЗЕРВ	
#define externAO			BIT_TST_M(3701)			//*внешний сигнал АО
#define init_tst			BIT_TST_M(3702)			//Инициализация
#define init_clr			BIT_CLR_M(3702)			//Инициализация
#define updateTun			BIT_TST_M(3703)			//Обновление настроек
#define check				BIT_TST_M(3704)			//Проверка защит
#define startHP				BIT_TST_M(3705)			//*команда старта ХП
#define externNO			BIT_TST_M(3707)			//*команда нормального останова
#define externDeblock		BIT_TST_M(3708)			//внешняя команда деблокировки аварии
#define up					BIT_TST_M(3710)			//*Команда на увеличение режима
#define down				BIT_TST_M(3711)			//*Команда на снижение режима
#define maxReg				BIT_TST_M(3712)			//Признак максимального режима
#define startProm			BIT_TST_M(3737)			//*команда Режим Промывка

#define test_ao1_set        BIT_SET_M(11000)
#define test_ao1_tst        BIT_TST_M(11000)
#define test_ao2            BIT_SET_M(11001)
 
//!!!!#define PK	    	RF(1447)				//Полное давление воздуха за компрессором 0...2.5 Мпа 
//#define PvrpST    		RF(1453)				//Полное давление воздуха в разгрузочной полости СТ 0…0.16МПа
//#define PzaTur			RF(1415)				//Избыточное давление газа за турбиной ГГ 0...0.6 МПа 
//БЗД
#define controlBZD_tst	    BIT_TST_M(3031)			//??Исправность БЭО
#define aoBZD_tst	        BIT_TST_M(3113)			//??Автоматическое включение БЭО
                                                                   


//Функции Саши Долгова по ВНА
short int int_my( double par )
{
	short int zn;
	zn = (short int)par;
	if( (( par - zn ) * 100000) >= 44445 )
	{
		zn++;
	}
	return zn;
}
angle( float *in,  short int *angle, short int *per );





int GefMain(void)
{

//Локальные данные
int			 I;
static float	z;
static float	Nvd1Tmp, Nvd2Tmp, Nst1Tmp, Nst2Tmp;	//Переменные для темпового контроля
static float	Nvd1, Nvd2, Nvd3, Nvd4;				//Переменные для фильтрации Nvd
static float	Nstf1, Nstf2, Nstf3, Nstf4;			//Переменные для фильтрации Nst
static float	Tvh1, Tvh2, Tvh3, Tvh4,Tvh5,Tvh6,Tvh7,Tvh8,Tvh9,Tvh10;//Переменные для фильтрации Tvh
static float	Tvh_old,Tvh_timer1,Tvh_timer2;
//static char		Tvh_temp;
static float	Ttzap1, Ttzap2, Ttzap3, Ttzap4;		//Переменные для фильтрации Ttzap
static float	Pk1, Pk2, Pk3, Pk4;					//Переменные для фильтрации Рк
static float	PtgPd1, PtgPd2, PtgPd3, PtgPd4;		//Переменные для фильтрации Ртгпд
static float	PtgSk1, PtgSk2, PtgSk3, PtgSk4;		//Переменные для фильтрации Ртгск
static float	Psuf1, Psuf2, Psuf3, Psuf4;			//Переменные для фильтрации Рсуфл
static float	VibPp4, VibPp3, VibPp2, VibPp1;		//Переменные для расчёта роста вибрации в зоне ПП
static float	VibZp4,	VibZp3, VibZp2, VibZp1;		//Переменные для расчёта роста вибрации в зоне ЗП 
static float	dTtzap,dTtzap1,dTtzap2,dTtzap3,dTtzap4,dTtzap5;	//Скорость роста температуры на запусковой термопаре
static float	dNvd,dNvd1,dNvd2,dNvd3,dNvd4,dNvd5;		//Скорость роста частоты газогенератора

static float	dNst,dNst1,dNst2,dNst3,dNst4,dNst5;		//Скорость роста частоты свободной турбины
static float	A_ObRaskrST_timer;


static float	TtSr;								//Переменная для расчета средней Тт
static float	TtSr1;								//Переменная для расчета средней Тт
static float	TtSrI;								//Счетчик для расчета средней Тт
static float	TstSr;								//Переменная для расчета средней Тст
static float	TstSr1;								//Переменная для расчета средней Тст
static float	TstSrI;								//Счетчик для расчета средней Тст
float			Ctzap1;

//Таймеры
static float	NggHighTimer;						//
static float	NggHighLimTimer;
static float	NggLowTimer;
//!!!!static float	NstHighTimer;
//!!!!static float	NstRaskrTimer;
//!!!!static float	NstObrRaskrTimer;
static float	PsuflHighTimer;
static float	PsuflLimTimer;
static float	PrpkTimer;
static float	TtstartLimTimer;
static float	TtstartHighLimTimer;
static float	TtHighTimer;
static float	TtHighAlarmTimer;
static float	TtHighLimTimer;
static float	TtzapBrkDopTimer;
static float	TtBrkDopTimer;
//!!!!static float	TstHighTimer;
//!!!!static float	TstHighAlarmTimer;
//!!!!static float	TstHighLimTimer;
static float	distortTtBrkTimer;
//!!!!static float	distortTstBrkTimer;
static float	distortTtTimer;
//!!!!static float	distortTstTimer;
static float	PkLimTimer;
static float	PtgLimTimer;
static float	PtgHighTimer;
static float	PtgAlarmTimer;
static float	PtgLowTimer;
static float	PtgMinTimer;
static float	PtgMinLimTimer;
static float	maxDeltaVNAPosTimer;
static float	maxDeltaVNANegTimer;
static float	VNABrkDopTimer;
static float	maxDeltaVNA12Timer;
static float	maxTimeDeltaDUSr;
static float	KPVBrkTimer;
static float	KPGBrkTimer;
static float	SKBrkOnTimer;
static float	SKBrkOffTimer;
static float	UtechkaTGTimer;
static float	UtechkaTGnoTimer;
static float	maxFSTTimer;
static float	maxBrkTimer;
static float	setDUSBrkTimer;
static float	mesDUSBrkTimer;
static float	SKNotOnFireTimer;
static float    VibDMaxTimer;
static float	VibDZPTimer;
static float	VibDPPTimer;
static float	TmvhDminTimer;
static float	TmvhDmaxTimer;
static float	PompazTimer;
static float	PogasTimer;
static float	TtzapTimer;
static float	Ngg_MGTimer;
static float	Ngg_maxTimer;
static float	Nst_ogrTimer;
static float	Nst_maxTimer;
static float	osStimer;
static float 	Reg_Ttzap_max;					//Регулировка предельной температуры газа на запуске
static float 	Reg_Ngg_MG;						//Регулировка минимальной частоты вращения ГГ
static float 	Reg_Ngg_Max;					//Регулировка максимальной частоты вращения ГГ
static float 	Reg_Pk_ogr;						//Регулировка ограничения Рк
static float 	Reg_Tt_ogr;						//Регулировка ограничения Т газа за турбиной ГГ на режимах
static float 	Reg_Nst_ogr;					//Регулировка ограничения максимальной частоты вращения СТ
static float 	Reg_Nst_SZTR;					//Регулировка аварии по максимальной частоте вращения СТ
static float	N_StrKPtimer;
static float	N_StrSPKtimer;
static float	N_StrRPTtimer;
static float	N_StrSTtimer;
static float	N_StrFStimer;

static float    TimerTvh;
static float    A_NvdDistortTimer;
static float	A_NstDistortTimer;
static float	A_PgInStVmin_Timer;
static float	N_deltaPvxMax_Timer;
static float	P_deltaPvxHigh_Timer;

double an, pe;
double x6, x5, x4, x3, x2, x1;


//обработка сигнала с 1-ого датчика ДБСКТ (ВНА верхний)	
	x1 = RF(999);

	if( x1 >= 0.0 && x1 < 320 )
	{
		x1 = x1/3.0;
	}
	else
	{
		x1 = (x1-360.0)/3.0;
	}

	x2 = x1*x1;
	x3 = x2*x1;
	x4 = x2*x2;
	x5 = x4*x1;
	x6 = x3*x3;
	an =	(-0.0000000000775716234064434)*x6 + 
			(0.0000000177727826726853)*x5 + 
			(-0.00000119224447024393)*x4 + 
			(-0.0000126231840450915)*x3 + 
			(0.00427493334764372)*x2 + 
			(0.377244245538523)*x1 + 
			(-44.9730241507935);
	if( an > 0.0 ) 
	{
		an = 0.0; 
	}
	if( an < -45.0 ) 
	{
		an = -45.0; 
	}

	an = (45.0/45.0)*an; 						 
	RI(1593)= int_my(an*100.0);			

	RF(1599)= an; //запоминаем у нас

	pe = (((an)+45.0)/45.0)*100.0; 
	if( pe > 100.0 )
	{
		pe = 100.0;
	}
	if( pe < 0.0 )
	{
		pe = 0.0;
	}

	RI(1597)= int_my(pe*100.0);


//обработка сигнала со 2-ого датчика ДБСКТ	(ВНА нижний)
/*
	x1 = RF(1459);

	if( x1 >= 0.0 && x1 < 320 )
	{
		x1 = x1/3.0;
	}
	else
	{
		x1 = (x1-360.0)/3.0;
	}

	x2 = x1*x1;
	x3 = x2*x1;
	x4 = x2*x2;
	x5 = x4*x1;
	x6 = x3*x3;
	an =	(-0.0000000000775716234064434)*x6 + 
			(0.0000000177727826726853)*x5 + 
			(-0.00000119224447024393)*x4 + 
			(-0.0000126231840450915)*x3 + 
			(0.00427493334764372)*x2 + 
			(0.377244245538523)*x1 + 
			(-44.9730241507935);
	if( an > 0.0 ) // an > 5.0
	{
		an = 0.0; //an = 5.0
	}
	if( an < -45.0 ) //an < -50.0
	{
		an = -45.0; // an = 50
	}

	an = (45.0/45.0)*an; // an = (50.0/45.0)*an;
	//RI(1544)= int_my(an*100.0); 

	RF(1551)= an; //запоминаем у нас

	pe = (((an)+45.0)/45.0)*100.0; //pe = (((an)+50.0)/55.0)*100.0; (было 5 до -50)
	if( pe > 100.0 )
	{
		pe = 100.0;
	}
	if( pe < 0.0 )
	{
		pe = 0.0;
	}

	//RI(1546)= int_my(pe*100.0);
*/

//Механизм ввода регулировок
if (updateTun) {


if ((Reg_Ttzap_max_u >= -100.0)&&(Reg_Ttzap_max_u <= 100.0)) Reg_Ttzap_max = Reg_Ttzap_max_u;
if ((Reg_Ngg_MG_u >= -500.0)&&(Reg_Ngg_MG_u <= 1000.0)) Reg_Ngg_MG = Reg_Ngg_MG_u;
if ((Reg_Ngg_Max_u >= -1000.0)&&(Reg_Ngg_Max_u <= 1000.0)) Reg_Ngg_Max = Reg_Ngg_Max_u;
if ((Reg_Pk_ogr_u >= -0.6)&&(Reg_Pk_ogr_u <= 0.6)) Reg_Pk_ogr = Reg_Pk_ogr_u;
if ((Reg_Tt_ogr_u >= -600.0)&&(Reg_Tt_ogr_u <= 300.0)) Reg_Tt_ogr = Reg_Tt_ogr_u;
if ((Reg_Nst_ogr_u >= -1000.0)&&(Reg_Nst_ogr_u <= 1500.0)) Reg_Nst_ogr = Reg_Nst_ogr_u;
if ((Reg_Nst_SZTR_u >= -1000.0)&&(Reg_Nst_SZTR_u <=3000.0)) Reg_Nst_SZTR = Reg_Nst_SZTR_u;

}
//сброс внешних признаков отказов по деблокировке
if (externDeblock) {FNST1_clr;FNST2_clr;FNGG1_clr;FNGG2_clr;P_Tt1BrkOtkl_clr;P_Tt2BrkOtkl_clr;P_Tt3BrkOtkl_clr;}

//Проверка 1-го канала оборотов ГГ
    if (((NGG1<minValNvd)&&(startTimer>NvdTimerContr)&&(condition>1)&&(condition!=6))||((NGG1<minValNvdFire)&&(firePresent_tst))||(NGG1>maxValNvd)) P_Nvd1BrkDop_set; 
		else P_Nvd1BrkDop_clr;
	if ((abs(NGG1-Nvd1Tmp)>maxDeltaNvdTmp)&&(Pkvd>PkContr)) P_Nvd1BrkTmp_set;
		else if (P_Nvd1BrkTmp_tst && externDeblock) P_Nvd1BrkTmp_clr;
	Nvd1Tmp=NGG1;

//Проверка 2-го канала оборотов ГГ
    if (((NGG2<minValNvd)&&(startTimer>NvdTimerContr)&&(condition>1)&&(condition!=6))||((NGG2<minValNvdFire)&&(firePresent_tst))||(NGG2>maxValNvd)) P_Nvd2BrkDop_set; 
		else P_Nvd2BrkDop_clr;
	if ((abs(NGG2-Nvd2Tmp)>maxDeltaNvdTmp)&&(Pkvd>PkContr)) P_Nvd2BrkTmp_set;
		else if (P_Nvd2BrkTmp_tst && externDeblock) P_Nvd2BrkTmp_clr;
	Nvd2Tmp=NGG2;

	if (externDeblock) {A_NvdBrk_clr;A_NvdDistort_clr;}

	if (FNGG1||P_Nvd1BrkDop_tst||P_Nvd1BrkTmp_tst)
		if (FNGG2||P_Nvd2BrkDop_tst||P_Nvd2BrkTmp_tst) A_NvdBrk_set;
			else Nvd1=NGG2;
	  else if (FNGG2||P_Nvd2BrkDop_tst||P_Nvd2BrkTmp_tst) Nvd1=NGG1;
			   else if ((abs(NGG2-NGG1)>maxDeltaNvd)&&(Pkvd>PkContr)) A_NvdDistortTimer +=cycle;
						else  { if (NGG2>NGG1) Nvd1=NGG2;
								   else Nvd1=NGG1;
							   A_NvdDistortTimer = 0.0;
							   }
	 if (A_NvdDistortTimer > 0.3) A_NvdDistortTimer=0.3;
	 if (A_NvdDistortTimer >= 0.3) A_NvdDistort_set;
		else if (externDeblock) A_NvdDistort_clr; 

		
	if ((condition==6)||(condition==1))
		if (NGG2>NGG1) Nvd1=NGG2;
			else Nvd1=NGG1;

	if (((!A_NvdBrk_tst)&&(!A_NvdDistort_tst))||(condition==6)||(condition==1))
	{ nvd=(Nvd1 + Nvd2 + Nvd3 + Nvd4)/4;
	  Nvd4=Nvd3;
	  Nvd3=Nvd2;
	  Nvd2=Nvd1;
	}
	    dNvd = (nvd - dNvd5)/(cycle *5);  
        dNvd5 = dNvd4;
        dNvd4 = dNvd3;
        dNvd3 = dNvd2;
        dNvd2 = dNvd1;
        dNvd1 = nvd;

//Проверка 1-го канала оборотов СТ
    if (((NST1<minValNst)&&(nvd>NvdContr))||((NST1<minValNst1)&&(nvd>NvdContr1))||(NST1>maxValNst)) P_Nst1BrkDop_set; 
		else P_Nst1BrkDop_clr;
	if ((abs(NST1-Nst1Tmp)>maxDeltaNstTmp)&&(NvdContr)) P_Nst1BrkTmp_set;
		else if (P_Nst1BrkTmp_tst && externDeblock) P_Nst1BrkTmp_clr;
	Nst1Tmp=NST1;

//Проверка 2-го канала оборотов СТ
    if (((NST2<minValNst)&&(nvd>NvdContr))||((NST2<minValNst1)&&(nvd>NvdContr1))||(NST2>maxValNst)) P_Nst2BrkDop_set; 
		else P_Nst2BrkDop_clr;
	if ((abs(NST2-Nst2Tmp)>maxDeltaNstTmp)&&(NvdContr)) P_Nst2BrkTmp_set;
		else if (P_Nst2BrkTmp_tst && externDeblock) P_Nst2BrkTmp_clr;
	Nst2Tmp=NST2;

	if (externDeblock) {A_NstBrk_clr;A_NstDistort_clr;}
	
		if (FNST1||P_Nst1BrkDop_tst||P_Nst1BrkTmp_tst)
		if (FNST2||P_Nst2BrkDop_tst||P_Nst2BrkTmp_tst) A_NstBrk_set;
			else Nstf1=NST2;
	  else if (FNST2||P_Nst2BrkDop_tst||P_Nst2BrkTmp_tst) Nstf1=NST1;
			   else if ((abs(NST2-NST1)>maxDeltaNst)&&(NvdContr)) A_NstDistortTimer +=cycle;
						else  { if (NST2>NST1) Nstf1=NST2;
								   else Nstf1=NST1;
							   A_NstDistortTimer = 0.0;
							   }
	if (A_NstDistortTimer > 0.3) A_NstDistortTimer=0.3;
	 if (A_NstDistortTimer >= 0.3) A_NstDistort_set;
		else if (externDeblock) A_NstDistort_clr; 
	
  	if ((condition==6)||(condition==1))
		if (NST2>NST1) Nstf1=NST2;
		   else Nstf1=NST1;
		
	if (((!A_NstBrk_tst)&&(!A_NstDistort_tst))||(condition==6)||(condition==1))
	{ nst=(Nstf1 + Nstf2 + Nstf3 + Nstf4)/4;
	  Nstf4=Nstf3;
	  Nstf3=Nstf2;
	  Nstf2=Nstf1;
	}

	//Вычисление производной частоты
	dNst = (nst - dNst5)/(cycle *5);  
        dNst5 = dNst4;
        dNst4 = dNst3;
        dNst3 = dNst2;
        dNst2 = dNst1;
        dNst1 = nst;

//Температура на входе в дозатор
Tpdtg = TR_FG;
if (Tpdtg<-70) Tpdtg=-70;
if (Tpdtg>200) Tpdtg=200;

RF(1517) = RF(1517) + 273.0;

RF(1519) = RF(1519) + 273;

RF(1521) = RF(1521) + 273;

RF(1523) = RF(1523) + 273;

//Проверка и фильтрация канала Твх
	Tvh1=CT_IF+273;
	if ((Tvh1<minValTvh)||(Tvh1>maxValTvh)) P_TvhBrkDop_set;
		else P_TvhBrkDop_clr;
	
	if (((!P_TvhBrkDop_tst)&&(!FCT_IF))||(condition==6)||(condition==1))
	{ Tvh=(Tvh1 + Tvh2 + Tvh3 + Tvh4)/4;
	  Tvh4=Tvh3;
	  Tvh3=Tvh2;
	  Tvh2=Tvh1;
	}
		
	nvdNorm=nvd*sqrt(288.15/Tvh);

	if (firePresent_tst) TtzapBrkDopTimer=TtzapBrkDopTimer + cycle; else TtzapBrkDopTimer=0;
	if (TtzapBrkDopTimer>=5) TtzapBrkDopTimer=5;

/*	
//Проверка 1-го канала Ттзап
	if ( (((TTXG1<minValTtStart)||(TTXG1>maxValTtStart))&&(TtzapBrkDopTimer<5))||(((TTXG1<minValTtStartFire)||(TTXG1>maxValTtStartFire))&&(firePresent_tst)&&(TtzapBrkDopTimer>=5)) ) P_Ttzap1BrkDop_set;
		else P_Ttzap1BrkDop_clr;
//Проверка 2-го канала Ттзап
	if ( (((TTXG2<minValTtStart)||(TTXG2>maxValTtStart))&&(TtzapBrkDopTimer<5))||(((TTXG2<minValTtStartFire)||(TTXG2>maxValTtStartFire))&&(firePresent_tst)&&(TtzapBrkDopTimer>=5)) ) P_Ttzap2BrkDop_set; 
		else P_Ttzap2BrkDop_clr;
*/	
	if (externDeblock) {P_TtzapBrk_clr;P_TtzapDistort_clr;}
	
	if (FTTXG1||P_Ttzap1BrkDop_tst)
		if (FTTXG2||P_Ttzap2BrkDop_tst) P_TtzapBrk_set;
			else Ttzap1=TTXG2+273;
	  else if (FTTXG2||P_Ttzap2BrkDop_tst) Ttzap1=TTXG1+273;
			   else if (abs(TTXG2-TTXG1)>maxDeltaTtStart) P_TtzapDistort_set;
						else  { if (TTXG2>TTXG1) Ttzap1=TTXG2+273;
								   else Ttzap1=TTXG1+273;
							   }

	if ((condition==6)||(condition==1))
		if (TTXG2>TTXG1) Ttzap1=TTXG2+273;
			else Ttzap1=TTXG1+273;

	if (((!P_TtzapBrk_tst)&&(!P_TtzapDistort_tst))||(condition==6)||(condition==1))
	{ Ttzap=(Ttzap1 + Ttzap2 + Ttzap3 + Ttzap4)/4;
	  Ttzap4=Ttzap3;
	  Ttzap3=Ttzap2;
	  Ttzap2=Ttzap1;
	}
		else Ttzap=Tt;
		
		dTtzap = (Ttzap - dTtzap5)/(cycle *5);  
        dTtzap5 = dTtzap4;
        dTtzap4 = dTtzap3;
        dTtzap3 = dTtzap2;
        dTtzap2 = dTtzap1;
        dTtzap1 = Ttzap;
    

//Проверка каналов измерения Тт и вычисление Тт
	if (firePresent_tst) TtBrkDopTimer=TtBrkDopTimer + cycle; else TtBrkDopTimer=0;
	if (TtBrkDopTimer>=10) TtBrkDopTimer=10;

if (!check) {
	if ( (!firePresent_tst) || ((firePresent_tst)&&(TtBrkDopTimer<10)) )
		{if ((TTXH1<minValTt)||(TTXH1>(maxValTt + 200.0)))  P_Tt1BrkDop_set; 
		    else P_Tt1BrkDop_clr;
		 if ((TTXH2<minValTt)||(TTXH2>(maxValTt + 200.0)))  P_Tt2BrkDop_set; 
		    else P_Tt2BrkDop_clr;
		 if ((TTXH3<minValTt)||(TTXH3>(maxValTt + 200.0)))  P_Tt3BrkDop_set; 
		    else P_Tt3BrkDop_clr;
		 if ((TTXH4<minValTt)||(TTXH4>(maxValTt + 200.0)))  P_Tt4BrkDop_set; 
		    else P_Tt4BrkDop_clr;
	     if ((TTXH5<minValTt)||(TTXH5>(maxValTt + 200.0)))  P_Tt5BrkDop_set; 
		    else P_Tt5BrkDop_clr;
		 if ((TTXH6<minValTt)||(TTXH6>(maxValTt + 200.0)))  P_Tt6BrkDop_set; 
		    else P_Tt6BrkDop_clr;
		 if ((TTXH7<minValTt)||(TTXH7>(maxValTt + 200.0)))  P_Tt7BrkDop_set; 
		    else P_Tt7BrkDop_clr;
		 if ((TTXH8<minValTt)||(TTXH8>(maxValTt + 200.0)))  P_Tt8BrkDop_set; 
		    else P_Tt8BrkDop_clr;
		 if ((TTXH9<minValTt)||(TTXH9>(maxValTt + 200.0)))  P_Tt9BrkDop_set; 
		    else P_Tt9BrkDop_clr;
		 if ((TTXH10<minValTt)||(TTXH10>(maxValTt + 200.0)))  P_Tt10BrkDop_set; 
		    else P_Tt10BrkDop_clr;
		 if ((TTXH11<minValTt)||(TTXH11>(maxValTt + 200.0)))  P_Tt11BrkDop_set; 
		    else P_Tt11BrkDop_clr;
		 if ((TTXH12<minValTt)||(TTXH12>(maxValTt + 200.0)))  P_Tt12BrkDop_set; 
		    else P_Tt12BrkDop_clr;
		 }	
		else {if ((TTXH1<minValTtFire)||(TTXH1>maxValTtFire))  P_Tt1BrkDop_set; 
			    else P_Tt1BrkDop_clr;
			 if ((TTXH2<minValTtFire)||(TTXH2>maxValTtFire))  P_Tt2BrkDop_set; 
			    else P_Tt2BrkDop_clr;
			 if ((TTXH3<minValTtFire)||(TTXH3>maxValTtFire))  P_Tt3BrkDop_set; 
				else P_Tt3BrkDop_clr;
			 if ((TTXH4<minValTtFire)||(TTXH4>maxValTtFire))  P_Tt4BrkDop_set; 
			    else P_Tt4BrkDop_clr;
			 if ((TTXH5<minValTtFire)||(TTXH5>maxValTtFire))  P_Tt5BrkDop_set; 
				else P_Tt5BrkDop_clr;
			 if ((TTXH6<minValTtFire)||(TTXH6>maxValTtFire))  P_Tt6BrkDop_set; 
			    else P_Tt6BrkDop_clr;
			 if ((TTXH7<minValTtFire)||(TTXH7>maxValTtFire))  P_Tt7BrkDop_set; 
				else P_Tt7BrkDop_clr;
			 if ((TTXH8<minValTtFire)||(TTXH8>maxValTtFire))  P_Tt8BrkDop_set; 
			    else P_Tt8BrkDop_clr;
			 if ((TTXH9<minValTtFire)||(TTXH9>maxValTtFire))  P_Tt9BrkDop_set; 
			    else P_Tt9BrkDop_clr;
			 if ((TTXH10<minValTtFire)||(TTXH10>maxValTtFire))  P_Tt10BrkDop_set; 
				else P_Tt10BrkDop_clr;
			 if ((TTXH11<minValTtFire)||(TTXH11>maxValTtFire))  P_Tt11BrkDop_set; 
			    else P_Tt11BrkDop_clr;
			 if ((TTXH12<minValTtFire)||(TTXH12>maxValTtFire))  P_Tt12BrkDop_set; 
			    else P_Tt12BrkDop_clr;
			 }
}
	TtSr=0;TtSrI=0;
	if (!(FTTXH1||P_Tt1BrkDop_tst||P_Tt1BrkOtkl_tst)) {TtSr=TtSr + TTXH1;TtSrI=TtSrI+1;}
	if (!(FTTXH2||P_Tt2BrkDop_tst||P_Tt2BrkOtkl_tst)) {TtSr=TtSr + TTXH2;TtSrI=TtSrI+1;}
	if (!(FTTXH3||P_Tt3BrkDop_tst||P_Tt3BrkOtkl_tst)) {TtSr=TtSr + TTXH3;TtSrI=TtSrI+1;}
	if (!(FTTXH4||P_Tt4BrkDop_tst||P_Tt4BrkOtkl_tst)) {TtSr=TtSr + TTXH4;TtSrI=TtSrI+1;}
	if (!(FTTXH5||P_Tt5BrkDop_tst||P_Tt5BrkOtkl_tst)) {TtSr=TtSr + TTXH5;TtSrI=TtSrI+1;}
	if (!(FTTXH6||P_Tt6BrkDop_tst||P_Tt6BrkOtkl_tst)) {TtSr=TtSr + TTXH6;TtSrI=TtSrI+1;}
	if (!(FTTXH7||P_Tt7BrkDop_tst||P_Tt7BrkOtkl_tst)) {TtSr=TtSr + TTXH7;TtSrI=TtSrI+1;}
	if (!(FTTXH8||P_Tt8BrkDop_tst||P_Tt8BrkOtkl_tst)) {TtSr=TtSr + TTXH8;TtSrI=TtSrI+1;}
	if (!(FTTXH9||P_Tt9BrkDop_tst||P_Tt9BrkOtkl_tst)) {TtSr=TtSr + TTXH9;TtSrI=TtSrI+1;}
	if (!(FTTXH10||P_Tt10BrkDop_tst||P_Tt10BrkOtkl_tst)) {TtSr=TtSr + TTXH10;TtSrI=TtSrI+1;}
	if (!(FTTXH11||P_Tt11BrkDop_tst||P_Tt11BrkOtkl_tst)) {TtSr=TtSr + TTXH11;TtSrI=TtSrI+1;}
	if (!(FTTXH12||P_Tt12BrkDop_tst||P_Tt12BrkOtkl_tst)) {TtSr=TtSr + TTXH12;TtSrI=TtSrI+1;}

	if (TtSrI>2)
		{TtSr=TtSr/TtSrI;TtSrI=0;TtSr1=0;
		if (!(FTTXH1||P_Tt1BrkDop_tst))
			if (abs(TtSr-TTXH1)>distortTtBrk) P_Tt1BrkOtkl_set;
				else {P_Tt1BrkOtkl_clr;TtSr1=TtSr1 + TTXH1;TtSrI=TtSrI+1;}
		if (!(FTTXH2||P_Tt2BrkDop_tst))
			if (abs(TtSr-TTXH2)>distortTtBrk) P_Tt2BrkOtkl_set;
				else {P_Tt2BrkOtkl_clr;TtSr1=TtSr1 + TTXH2;TtSrI=TtSrI+1;}
		if (!(FTTXH3||P_Tt3BrkDop_tst))
			if (abs(TtSr-TTXH3)>distortTtBrk) P_Tt3BrkOtkl_set;
				else {P_Tt3BrkOtkl_clr;TtSr1=TtSr1 + TTXH3;TtSrI=TtSrI+1;}
		if (!(FTTXH4||P_Tt4BrkDop_tst))
			if (abs(TtSr-TTXH4)>distortTtBrk) P_Tt4BrkOtkl_set;
				else {P_Tt4BrkOtkl_clr;TtSr1=TtSr1 + TTXH4;TtSrI=TtSrI+1;}
		if (!(FTTXH5||P_Tt5BrkDop_tst))
			if (abs(TtSr-TTXH5)>distortTtBrk) P_Tt5BrkOtkl_set;
				else {P_Tt5BrkOtkl_clr;TtSr1=TtSr1 + TTXH5;TtSrI=TtSrI+1;}
		if (!(FTTXH6||P_Tt6BrkDop_tst))
			if (abs(TtSr-TTXH6)>distortTtBrk) P_Tt6BrkOtkl_set;
				else {P_Tt6BrkOtkl_clr;TtSr1=TtSr1 + TTXH6;TtSrI=TtSrI+1;}
		if (!(FTTXH7||P_Tt7BrkDop_tst))
			if (abs(TtSr-TTXH7)>distortTtBrk) P_Tt7BrkOtkl_set;
				else {P_Tt7BrkOtkl_clr;TtSr1=TtSr1 + TTXH7;TtSrI=TtSrI+1;}
		if (!(FTTXH8||P_Tt8BrkDop_tst))
			if (abs(TtSr-TTXH8)>distortTtBrk) P_Tt8BrkOtkl_set;
				else {P_Tt8BrkOtkl_clr;TtSr1=TtSr1 + TTXH8;TtSrI=TtSrI+1;}
		if (!(FTTXH9||P_Tt9BrkDop_tst))
			if (abs(TtSr-TTXH9)>distortTtBrk) P_Tt9BrkOtkl_set;
				else {P_Tt9BrkOtkl_clr;TtSr1=TtSr1 + TTXH9;TtSrI=TtSrI+1;}
		if (!(FTTXH10||P_Tt10BrkDop_tst))
			if (abs(TtSr-TTXH10)>distortTtBrk) P_Tt10BrkOtkl_set;
				else {P_Tt10BrkOtkl_clr;TtSr1=TtSr1 + TTXH10;TtSrI=TtSrI+1;}
		if (!(FTTXH11||P_Tt11BrkDop_tst))
			if (abs(TtSr-TTXH11)>distortTtBrk) P_Tt11BrkOtkl_set;
				else {P_Tt11BrkOtkl_clr;TtSr1=TtSr1 + TTXH11;TtSrI=TtSrI+1;}
		if (!(FTTXH12||P_Tt12BrkDop_tst))
			if (abs(TtSr-TTXH12)>distortTtBrk) P_Tt12BrkOtkl_set;
				else {P_Tt12BrkOtkl_clr;TtSr1=TtSr1 + TTXH12;TtSrI=TtSrI+1;}
		if (TtSrI<3) N_TtBrk_set;
				else TtSr1=TtSr1/TtSrI;
		}
	 else N_TtBrk_set;

	if ((TtSrI>2)&&externDeblock&&N_TtBrk_tst) N_TtBrk_clr;

	if (N_TtBrk_tst&&P_TtzapBrk_tst) A_TtTtzapBrk_set;				// Одновременный отказ Тт и Ттзап
		else if (externDeblock) A_TtTtzapBrk_clr;
		
	if ((!N_TtBrk_tst)||(condition==6)||(condition==1)) Tt=TtSr1+273;//!!!!!!!
	
//Проверка каналов измерения Тcт и вычисление Тcт
	if ((TTXL1<minValTst)||(TTXL1>maxValTst))  P_Tst1BrkDop_set; 
	    else P_Tst1BrkDop_clr;
	if ((TTXL2<minValTst)||(TTXL2>maxValTst))  P_Tst2BrkDop_set; 
	    else P_Tst2BrkDop_clr;
	if ((TTXL3<minValTst)||(TTXL3>maxValTst))  P_Tst3BrkDop_set; 
	    else P_Tst3BrkDop_clr;
	if ((TTXL4<minValTst)||(TTXL4>maxValTst))  P_Tst4BrkDop_set; 
	    else P_Tst4BrkDop_clr;
	if ((TTXL5<minValTst)||(TTXL5>maxValTst))  P_Tst5BrkDop_set; 
	    else P_Tst5BrkDop_clr;
	if ((TTXL6<minValTst)||(TTXL6>maxValTst))  P_Tst6BrkDop_set; 
	    else P_Tst6BrkDop_clr;
	if ((TTXL7<minValTst)||(TTXL7>maxValTst))  P_Tst7BrkDop_set; 
	    else P_Tst7BrkDop_clr;
	if ((TTXL8<minValTst)||(TTXL8>maxValTst))  P_Tst8BrkDop_set; 
	    else P_Tst8BrkDop_clr;
	if ((TTXL9<minValTst)||(TTXL9>maxValTst))  P_Tst9BrkDop_set; 
	    else P_Tst9BrkDop_clr;
	if ((TTXL10<minValTst)||(TTXL10>maxValTst))  P_Tst10BrkDop_set; 
	    else P_Tst10BrkDop_clr;
	if ((TTXL11<minValTst)||(TTXL11>maxValTst))  P_Tst11BrkDop_set; 
	    else P_Tst11BrkDop_clr;
	if ((TTXL12<minValTst)||(TTXL12>maxValTst))  P_Tst12BrkDop_set; 
	    else P_Tst12BrkDop_clr;
	

	TstSr=0;TstSrI=0;
	if (!(FTTXL1||P_Tst1BrkDop_tst||P_Tst1BrkOtkl_tst)) {TstSr=TstSr + TTXL1;TstSrI=TstSrI+1;}
	if (!(FTTXL2||P_Tst2BrkDop_tst||P_Tst2BrkOtkl_tst)) {TstSr=TstSr + TTXL2;TstSrI=TstSrI+1;}
	if (!(FTTXL3||P_Tst3BrkDop_tst||P_Tst3BrkOtkl_tst)) {TstSr=TstSr + TTXL3;TstSrI=TstSrI+1;}
	if (!(FTTXL4||P_Tst4BrkDop_tst||P_Tst4BrkOtkl_tst)) {TstSr=TstSr + TTXL4;TstSrI=TstSrI+1;}
	if (!(FTTXL5||P_Tst5BrkDop_tst||P_Tst5BrkOtkl_tst)) {TstSr=TstSr + TTXL5;TstSrI=TstSrI+1;}
	if (!(FTTXL6||P_Tst6BrkDop_tst||P_Tst6BrkOtkl_tst)) {TstSr=TstSr + TTXL6;TstSrI=TstSrI+1;}
	if (!(FTTXL7||P_Tst7BrkDop_tst||P_Tst7BrkOtkl_tst)) {TstSr=TstSr + TTXL7;TstSrI=TstSrI+1;}
	if (!(FTTXL8||P_Tst8BrkDop_tst||P_Tst8BrkOtkl_tst)) {TstSr=TstSr + TTXL8;TstSrI=TstSrI+1;}
	if (!(FTTXL9||P_Tst9BrkDop_tst||P_Tst9BrkOtkl_tst)) {TstSr=TstSr + TTXL9;TstSrI=TstSrI+1;}
	if (!(FTTXL10||P_Tst10BrkDop_tst||P_Tst10BrkOtkl_tst)) {TstSr=TstSr + TTXL10;TstSrI=TstSrI+1;}
	if (!(FTTXL11||P_Tst11BrkDop_tst||P_Tst11BrkOtkl_tst)) {TstSr=TstSr + TTXL11;TstSrI=TstSrI+1;}
	if (!(FTTXL12||P_Tst12BrkDop_tst||P_Tst12BrkOtkl_tst)) {TstSr=TstSr + TTXL12;TstSrI=TstSrI+1;}

	if (TstSrI>2)
		{TstSr=TstSr/TstSrI;TstSrI=0;TstSr1=0;
		if (!(FTTXL1||P_Tst1BrkDop_tst))
			if (abs(TstSr-TTXL1)>distortTstBrk) P_Tst1BrkOtkl_set;
				else {P_Tst1BrkOtkl_clr;TstSr1=TstSr1 + TTXL1;TstSrI=TstSrI+1;}
		if (!(FTTXL2||P_Tst2BrkDop_tst))
			if (abs(TstSr-TTXL2)>distortTstBrk) P_Tst2BrkOtkl_set;
				else {P_Tst2BrkOtkl_clr;TstSr1=TstSr1 + TTXL2;TstSrI=TstSrI+1;}
		if (!(FTTXL3||P_Tst3BrkDop_tst))
			if (abs(TstSr-TTXL3)>distortTstBrk) P_Tst3BrkOtkl_set;
				else {P_Tst3BrkOtkl_clr;TstSr1=TstSr1 + TTXL3;TstSrI=TstSrI+1;}
		if (!(FTTXL4||P_Tst4BrkDop_tst))
			if (abs(TstSr-TTXL4)>distortTstBrk) P_Tst4BrkOtkl_set;
				else {P_Tst4BrkOtkl_clr;TstSr1=TstSr1 + TTXL4;TstSrI=TstSrI+1;}
		if (!(FTTXL5||P_Tst5BrkDop_tst))
			if (abs(TstSr-TTXL5)>distortTstBrk) P_Tst5BrkOtkl_set;
				else {P_Tst5BrkOtkl_clr;TstSr1=TstSr1 + TTXL5;TstSrI=TstSrI+1;}
		if (!(FTTXL6||P_Tst6BrkDop_tst))
			if (abs(TstSr-TTXL6)>distortTstBrk) P_Tst6BrkOtkl_set;
				else {P_Tst6BrkOtkl_clr;TstSr1=TstSr1 + TTXL6;TstSrI=TstSrI+1;}
		if (!(FTTXL7||P_Tst7BrkDop_tst))
			if (abs(TstSr-TTXL7)>distortTstBrk) P_Tst7BrkOtkl_set;
				else {P_Tst7BrkOtkl_clr;TstSr1=TstSr1 + TTXL7;TstSrI=TstSrI+1;}
		if (!(FTTXL8||P_Tst8BrkDop_tst))
			if (abs(TstSr-TTXL8)>distortTstBrk) P_Tst8BrkOtkl_set;
				else {P_Tst8BrkOtkl_clr;TstSr1=TstSr1 + TTXL8;TstSrI=TstSrI+1;}
		if (!(FTTXL9||P_Tst9BrkDop_tst))
			if (abs(TstSr-TTXL9)>distortTstBrk) P_Tst9BrkOtkl_set;
				else {P_Tst9BrkOtkl_clr;TstSr1=TstSr1 + TTXL9;TstSrI=TstSrI+1;}
		if (!(FTTXL10||P_Tst10BrkDop_tst))
			if (abs(TstSr-TTXL10)>distortTstBrk) P_Tst10BrkOtkl_set;
				else {P_Tst10BrkOtkl_clr;TstSr1=TstSr1 + TTXL10;TstSrI=TstSrI+1;}
		if (!(FTTXL11||P_Tst11BrkDop_tst))
			if (abs(TstSr-TTXL11)>distortTstBrk) P_Tst11BrkOtkl_set;
				else {P_Tst11BrkOtkl_clr;TstSr1=TstSr1 + TTXL11;TstSrI=TstSrI+1;}
		if (!(FTTXL12||P_Tst12BrkDop_tst))
			if (abs(TstSr-TTXL12)>distortTstBrk) P_Tst12BrkOtkl_set;
				else {P_Tst12BrkOtkl_clr;TstSr1=TstSr1 + TTXL12;TstSrI=TstSrI+1;}
		if (TstSrI<3) N_TstBrk_set;
				else TstSr1=TstSr1/TstSrI;
		}
	 else N_TstBrk_set;

	if ((TstSrI>2)&&externDeblock&&N_TstBrk_tst) N_TstBrk_clr;
	
	if ((!N_TstBrk_tst)||(condition==6)||(condition==1)) Tst=TstSr1+273;


//Проверка и фильтрация канала Рк
	Pk1=PKizb;
	if ((Pk1<minValPk)||(Pk1>maxValPk)) P_PkBrkDop_set;
		else P_PkBrkDop_clr;
	if (((!P_PkBrkDop_tst)&&(!FPK))||(condition==6)||(condition==1))
	{ Pkvd=((Pk1 + Pk2 + Pk3 + Pk4)/4)+0.1;
	  Pk4=Pk3;
	  Pk3=Pk2;
	  Pk2=Pk1;
	}

//Проверка и фильтрация канала Ртгпд
	PtgPd1=PTGPTK;
	if ((PtgPd1<minValPtgPdSk)||(PtgPd1>maxValPtgPdSk)) P_PtgPdBrkDop_set;
		else P_PtgPdBrkDop_clr;
	if (((!P_PtgPdBrkDop_tst)&&(!FPTGTPK))||(condition==6)||(condition==1))
	{ Ptgpd=(PtgPd1 + PtgPd2 + PtgPd3 + PtgPd4)/4;
	  PtgPd4=PtgPd3;
	  PtgPd3=PtgPd2;
	  PtgPd2=PtgPd1;
	}
	if (Ptgpd < 0.01) Ptgpd = 0.01;
		else if (Ptgpd > 4.01) Ptgpd = 4.01;

//Проверка и фильтрация канала Ртгск
	PtgSk1=PTGVX;
	if ((PtgSk1<minValPtgPdSk)||(PtgSk1>maxValPtgPdSk)) P_PtgSkBrkDop_set;
		else P_PtgSkBrkDop_clr;
	if (((!P_PtgSkBrkDop_tst)&&(!FPTGVX))||(condition==6)||(condition==1))
	{ Ptg=(PtgSk1 + PtgSk2 + PtgSk3 + PtgSk4)/4;
	  PtgSk4=PtgSk3;
	  PtgSk3=PtgSk2;
	  PtgSk2=PtgSk1;
	}
	if (Ptg < 0.01) Ptg = 0.01;
		else if (Ptg > 4.01) Ptg = 4.01;

//Проверка и фильтрация канала Р cуфлирования
	Psuf1=Psuf;
	if ((!PsufBrk)||(condition==6)||(condition==1))
	{ Psufl_f=(Psuf1 + Psuf2 + Psuf3 + Psuf4)/4;
	  Psuf4=Psuf3;
	  Psuf3=Psuf2;
	  Psuf2=Psuf1;
	};

//Вычисление уставок и формирование аварийных сигналов
//Прекращение запука по ВТЗ
	 Ttzap_ogr_ust=(Reg_Ttzap_max+TtzapMax)*harakt(Ctzap,Tvh);
	 if ((Tt>Ttzap_ogr_ust)&&(nvd<(Ngg_MG_ust-deltaNvdLow))) TtzapTimer +=cycle; else TtzapTimer = 0.0;
	 if (TtzapTimer > 0.1) TtzapTimer = 0.1;
	 if (TtzapTimer >= 0.1) A_Ttzap_set;						//"Высокая температура газа  за турбиной ГГ на запуске"
		else if (externDeblock) A_Ttzap_clr;

//АО по провалу оборотов ниже минимального режима, уставка минимального режима
	Ngg_MG_ust=(Ngg_MG+Reg_Ngg_MG)*harakt(CNvdTinStart,Tvh);
	if ((nvd<(Ngg_MG_ust-deltaNvdLow))&&(condition==5)) Ngg_MGTimer +=cycle; else Ngg_MGTimer=0;
	if (Ngg_MGTimer > 0.1) Ngg_MGTimer=0.1;
	if (Ngg_MGTimer >= 0.1) A_NggLow_set;							//"Аварийно-низкая частота вращения ротора ГГ"
		else if (externDeblock) A_NggLow_clr;
//Коэффициент коррекции nvd по Твх, уставка максимального режима, АО по максимальным оборотам ГГ
	if (maxReg) CTvhNvd=harakt(CNvdTinMax,Tvh);
		else CTvhNvd=harakt(CNvdTin,Tvh);
	Ngg_max_ust=(Ngg_Max+Reg_Ngg_Max)*CTvhNvd;
	if (nvd>=(Ngg_max_ust+deltaNvd)) Ngg_maxTimer +=cycle; else Ngg_maxTimer=0;
	if (Ngg_maxTimer > 0.1) Ngg_maxTimer=0.1;
	if (Ngg_maxTimer >= 0.1) A_NggHigh_set;							//"Аварийно-высокая частота вращения ротора ГГ"	
		else if (externDeblock) A_NggHigh_clr;
//Уставка ограничения максимальных оборотов СТ
	Nst_ogr_ust=NstMax+Reg_Nst_ogr;
	if (nst>=(Nst_ogr_ust+deltaNst)) Nst_ogrTimer +=cycle; else Nst_ogrTimer=0;
	if (Nst_ogrTimer > 0.1) Nst_ogrTimer=0.1;
	if (Nst_ogrTimer >= 0.1) P_NstHigh_set;							// "Высокая частота вращения ротора СТ"
		else  P_NstHigh_clr;
//Уставка "Защита от раскрутки ротора свободной турбины",  АО по максимальным оборотам СТ
	Nst_max_ust=NstAlarm+Reg_Nst_SZTR;
	if (nst>=Nst_max_ust) Nst_maxTimer +=cycle; else Nst_maxTimer=0;
	if (Nst_maxTimer > 0.1) Nst_maxTimer=0.1;
	if (Nst_maxTimer >= 0.1) A_NstHigh_set;							//"Аварийно-высокая частота вращения ротора СТ"
		else if (externDeblock) A_NstHigh_clr;
//Уставка ограничения величины давления Рк
	if (maxReg) Pk_ogr_ust=(Pk_ogr_max+Reg_Pk_ogr);							
		else Pk_ogr_ust=(Pk_ogr_nom+Reg_Pk_ogr);
	
	if (Pkvd>=Pk_ogr_Alarm) P_PkvdHigh_set;							// "Повышенное давление воздуха за компрессором ГГ"
		else P_PkvdHigh_clr;

//Уставка ограничения температуры газа за турбиной ГГ на режимах, АО по максимальной Тт
		
		if (maxReg) Tt_ogr_ust=(TtMax+Reg_Tt_ogr)*harakt(CTtTinMax,Tvh);
		  else Tt_ogr_ust=(TtMax+Reg_Tt_ogr)*harakt(CTtTin,Tvh);
	
	if ((nvd>(Ngg_MG_ust-deltaNvdLow))||check)
		{if (Tt>(Tt_ogr_ust+DeltaTt3)) A_TtHigh_set;						//"Аварийно-высокая температура газа  за турбиной ГГ"
			else {if (externDeblock) A_TtHigh_clr;
				  if (Tt>(Tt_ogr_ust+DeltaTt2)) N_TtHigh_set;				//"Высокая температура газа  за турбиной ГГ"-НО
					else {if (externDeblock) N_TtHigh_clr;
						  if (Tt>(Tt_ogr_ust+DeltaTt1)) P_TtHigh_set;		//"Повышенная температура газа  за турбиной ГГ"
							else P_TtHigh_clr;}
					}}
		else if (externDeblock) {A_TtHigh_clr; N_TtHigh_clr; P_TtHigh_clr;}

		
//АО на основных режимах по ВТЗ
		
//		 if ((nvd>(Ngg_MG_ust-deltaNvdLow))||check)     
//			{if (Ttzap>(Tt_ogr_ust+DeltaTt3)) A_Ttzap_set;
//				else {if (externDeblock) A_Ttzap_clr;}}// Закоментировано, это было для 25 двигателя
				 
			

//Уставка ограничения температуры газа за СТ на режимах, АО по максимальной Тст
	if (maxReg) Tst_ogr_ust=TstMax*harakt(CTstTinMax,Tvh);
		else Tst_ogr_ust=TstMax*harakt(CTstTin,Tvh);
	if (Tst>TstMaxAlarm) A_TstHigh_set;
		else {if (externDeblock) A_TstHigh_clr;
			  if (Tst>(Tst_ogr_ust+DeltaTst)) N_TstHigh_set;
				else {if (externDeblock) N_TstHigh_clr;
					  if (Tst>Tst_ogr_ust) P_TstHigh_set;
					  
						else P_TstHigh_clr;}
				}



//Аварии и предупреждения по уставкам параметров не участвующих в регулировании

//Контроль температуры масла на входе в двигатель
  	if (TmvhD<=TmvhDLow) TmvhDminTimer += cycle; else TmvhDminTimer = 0.0;
	if (TmvhDminTimer > 1.0) TmvhDminTimer = 1.0;	 
	if (TmvhDminTimer == 1.0) P_TmvhDmin_set;       //"Пониженная температура масла на входе в двигатель"
		else P_TmvhDmin_clr;

  	if (TmvhD>=TmvhDHigh) TmvhDmaxTimer += cycle; else TmvhDmaxTimer = 0.0;
	if (TmvhDmaxTimer > 1.0) TmvhDmaxTimer = 1.0;	 
	if (TmvhDmaxTimer == 1.0) P_TmvhDmax_set;      //"Повышенная температура масла на входе в двигатель"
		else P_TmvhDmax_clr;
		

//!!!!Для электрического стартера не надо
//Контроль давления газа перед СтВ
  	if ( ((nvd<PgInStVContr)&&(startTimer>PgInStVMinTimer)&&(VZ_tst)&&(condition>1)&&(condition!=6)||check)
		  &&(PgInStV<=PgInStVLow)) A_PgInStVmin_Timer+=cycle; else A_PgInStVmin_Timer = 0.0;
		  if (A_PgInStVmin_Timer > 5.0)  A_PgInStVmin_Timer = 5.0;
		  
		  if (A_PgInStVmin_Timer >= 5.0) A_PgInStVmin_set; 						//"Низкое давление пускового газа перед СтВ"
		else if (externDeblock) A_PgInStVmin_clr;
  	
	
	
	
	
	
	if ( ((nvd<PgInStVContr)&&(startTimer<PgInStVMinTimer)&&(condition>1)&&(condition!=6)||check)
		&&(PgInStV<=PgInStVMin)) A_PgInStVmin_proval_set; 							//"Низкое давление пускового газа перед СтВ"
		else if (externDeblock) A_PgInStVmin_proval_clr;

  	if ((nvd<PgInStVContr)&&(PgInStV>=PgInStVHigh)) A_PgInStVmax_set; 		//"!Высокое давление пускового газа перед СтВ" до 7200
		else if (externDeblock) A_PgInStVmax_clr;

  	if (PgInStV>=PgInStVAlarm) A_PgInStVmax_set; 							//"Высокое давление пускового газа перед СтВ" на всех режимах
		else if (externDeblock) A_PgInStVmax_clr;

//Контроль давления газа перед СК
	if ((Ptg<=PtgMinLim)&&((condition>2)&&(!HP_tst)&&(!endHP_tst)&&(condition!=6)||check)) {A_PtgMin_set;P_PtgMin_clr;P_PtgLow_clr;}	//"Аварийно-низкое давление топливного газа перед СК"
		else {if (externDeblock) A_PtgMin_clr;
			  if ((Ptg<=PtgMin)&&((condition>2)&&(!HP_tst)&&(!endHP_tst)&&(condition!=6)||check)) {P_PtgMin_set;P_PtgLow_clr;}		//"Низкое давление топливного газа перед СК"
				else { P_PtgMin_clr;
					  if (Ptg<=PtgLow) P_PtgLow_set;																	//"Пониженное давление топливного газа перед СК"
						else P_PtgLow_clr;}
			  }

			 
	if (Ptg>=PtgAlarm)  PtgAlarmTimer+=cycle; else PtgAlarmTimer = 0.0;
	if (PtgAlarmTimer > 1.0) PtgAlarmTimer = 1.0;
	if (PtgAlarmTimer == 1.0) {A_PtgMax_set;P_PtgHigh_clr;}															//"Аварийно-высокое давление топливного газа перед СК"
		else {if (externDeblock) A_PtgMax_clr;}
	
	if (Ptg>=PtgMax) PtgHighTimer +=cycle; else PtgHighTimer = 0.0;
	if (PtgHighTimer > 1.0) PtgHighTimer = 1.0;
	if ((PtgHighTimer == 1.0)&&((condition>4)||check)) {N_PtgHigh_set;P_PtgHigh_clr;}
		else {if (externDeblock) N_PtgHigh_clr;}

	if (Ptg>=PtgHigh) PtgLimTimer +=cycle; else PtgLimTimer = 0.0;
	if (PtgLimTimer > 1.0) PtgLimTimer = 1.0;
	if (PtgLimTimer == 1.0) P_PtgHigh_set; else P_PtgHigh_clr;
		
		
	
	/*
		if (Ptg>=PtgAlarm) {A_PtgMax_set;P_PtgHigh_clr;}																	//"Аварийно-высокое давление топливного газа перед СК"
		else {if (externDeblock) A_PtgMax_clr;
			  if (Ptg>=PtgMax) {N_PtgHigh_set;P_PtgHigh_clr;}															//"Высокое давление топливного газа перед СК"
				else {if (externDeblock) N_PtgHigh_clr;
					  if (Ptg>=PtgHigh) P_PtgHigh_set;																	//"Повышенное давление топливного газа перед СК"
						else P_PtgHigh_clr;}
			  }		  
	*/		  
//Контроль температуры топливного газа перед ДГ
	if (Tpdtg<=TtgpdLow) P_TtgMin_set;			//Пониженная температура топливного газа перед ДГ
		else P_TtgMin_clr;

	if (Tpdtg>=TtgpdHigh) P_TtgMax_set;			//Повышенная температура топливного газа перед ДГ
		else P_TtgMax_clr;

//Контроль давления масла на входе в двигатель
	if ( ((nvd<PmvhDContr)&&(startTimer>PmvhDMinTimer)&&(condition>1)&&(condition!=6)||check)
		  &&(PmvhD<=PmvhDMin)) A_PmvhDno_set;									//"Нет давления масла на входе в двигатель"
		else if (externDeblock) A_PmvhDno_clr;

	
	if ((nvd>PmvhDContr)||check)
		{if(PmvhD<=PmvhDMinAlarm) {A_PmvhDmin_set;P_PmvhDlow_clr;}				//"Аварийно-низкое давление масла на входе в двигатель"
		   else {if (externDeblock) A_PmvhDmin_clr;
			     if (PmvhD<=PmvhDMinLim) {N_PmvhDmin_set;P_PmvhDlow_clr;}		//"Низкое давление масла на входе в двигатель"
				    else {if (externDeblock) N_PmvhDmin_clr;
					      if (PmvhD<=PmvhDLow) P_PmvhDlow_set;					//"Пониженное давление масла на входе в двигатель"
						    else P_PmvhDlow_clr;}
				}
		}
		   else {P_PmvhDlow_clr;
				if (externDeblock) {A_PmvhDmin_clr;N_PmvhDmin_clr;}
				}

		   
		   			
//Контроль давления суфлирования
	if  ((nvd>=nGGsuflcontr)||check)
		{if(Psuf>=PsuflLim) {N_PsufMax_set;P_PsufHigh_clr;}	//"Высокое давление суфлирования"
		   else {if (externDeblock) N_PsufMax_clr;
			     if (Psuf>=PsuflHigh) P_PsufHigh_set;		//"Повышенное давление суфлирования"
				     else P_PsufHigh_clr;}
		}	  
		else { P_PsufHigh_clr;
			  if (externDeblock) N_PsufMax_clr;}


//Контроль перепада между атмосферным давлением и полным давлением воздуха на входе в компрессор ГГ
if  ((nvd>nGGdeltaPvxcontr)||check)	
	{if (deltaPvx>=deltaPvxLim) N_deltaPvxMax_Timer +=cycle; else N_deltaPvxMax_Timer = 0.0;//"Входной тракт двигателя засорен"
	if (N_deltaPvxMax_Timer > 15.0) N_deltaPvxMax_Timer = 15.0;
	if (N_deltaPvxMax_Timer == 15.0) {N_deltaPvxMax_set;P_deltaPvxHigh_clr;}
		else {if (externDeblock) N_deltaPvxMax_clr;}

	if (deltaPvx>=deltaPvxHigh) P_deltaPvxHigh_Timer +=cycle; else P_deltaPvxHigh_Timer = 0.0;//"Повышенный перепад давления на входе в двигатель"
	if (P_deltaPvxHigh_Timer > 15.0) P_deltaPvxHigh_Timer = 15.0;
	if (P_deltaPvxHigh_Timer == 15.0) P_deltaPvxHigh_set; else P_deltaPvxHigh_clr;	  
	}		  
		else { P_deltaPvxHigh_clr;
			  if (externDeblock) N_deltaPvxMax_clr;}	  
		  
			  

//Контроль давления воздуха в разгрузочной полости компрессора
Pvrpkp=Pvrpk + 100.0;	
	if ((nvd>nGGPrpk)||check)
		{if (Pvrpkp>0.0758*Pkvd*1000.0+0.638*(100-deltaPvx)) P_PvrpkHigh_set; //повышенное давление воздуха в разгрузочной полости компрессора
			else P_PvrpkHigh_clr;}
	  else P_PvrpkHigh_clr;

//Контроль давления воздуха в разгрузочной полости CТ
PvrpST=PizbST + 0.1;	
	if ((nvd>10400)||check)
		{if ((PvrpST/Pkvd)<0.235) P_osSTHigh_set; 							//Повышенная осевая сила ротора СТ
			else P_osSTHigh_clr;}
	  else P_osSTHigh_clr;

//Контроль температуры масла на выходе из опоры ш/п КВД
	if ((nvd>=TmspKvdContr)||check)
		{if (TmspKvd>=TmspKvdAlarm) {A_TmspKvdMax_set;P_TmspKvdHigh_clr;}			//"Аварийно-высокая температура масла на выходе из опоры ш/п КВД"
		   else {if (externDeblock) A_TmspKvdMax_clr;
			     if (TmspKvd>=TmspKvdMax) {N_TmspKvdMax_set;P_TmspKvdHigh_clr;}		//"Высокая температура масла на выходе из опоры ш/п КВД"
				    else {if (externDeblock) N_TmspKvdMax_clr;
					      if (TmspKvd>=TmspKvdHigh) P_TmspKvdHigh_set;				//"Повышенная температура масла на выходе из опоры ш/п КВД"
						    else P_TmspKvdHigh_clr;}
				}
		}
		   else {P_TmspKvdHigh_clr;
				if (externDeblock) {A_TmspKvdMax_clr;N_TmspKvdMax_clr;}
				}

//Контроль температуры масла на выходе из опоры р/п ТВД
	if ((nvd>=TmrpTvdContr)||check)
		{if(TmrpTvd>=TmrpTvdAlarm) {A_TmrpTvdMax_set;P_TmrpTvdHigh_clr;}			//"Аварийно-высокая температура масла на выходе из опоры р/п ТВД"     !!!
		   else {if (externDeblock) A_TmrpTvdMax_clr;
			     if (TmrpTvd>=TmrpTvdMax) {N_TmrpTvdMax_set;P_TmrpTvdHigh_clr;}		//"Высокая температура масла на выходе из опоры р/п ТВД"
				    else {if (externDeblock) N_TmrpTvdMax_clr;
					      if (TmrpTvd>=TmrpTvdHigh) P_TmrpTvdHigh_set;				//"Повышенная температура масла на выходе из опоры р/п ТВД"
						    else P_TmrpTvdHigh_clr;}
				}
		}
		   else {P_TmrpTvdHigh_clr;
				if (externDeblock) {A_TmrpTvdMax_clr;N_TmrpTvdMax_clr;}
				}

//Контроль температуры масла на выходе из опор СТ
	if ((nvd>=TmopStContr)||check)
		{if(TmopSt>=TmopStAlarm) {A_TmopStMax_set;P_TmopStHigh_clr;}				//"Аварийно-высокая температура масла на выходе из опор СТ"
		   else {if (externDeblock) A_TmopStMax_clr;
			     if (TmopSt>=TmopStMax) {N_TmopStMax_set;P_TmopStHigh_clr;}			//"Высокая температура масла на выходе из опор СТ"
				    else {if (externDeblock) N_TmopStMax_clr;
					      if (TmopSt>=TmopStHigh) P_TmopStHigh_set;					//"Повышенная температура масла на выходе из опор СТ"
						    else P_TmopStHigh_clr;}
				}
		}
		   else {P_TmopStHigh_clr;
				if (externDeblock) {A_TmopStMax_clr;N_TmopStMax_clr;}
				}


//Контроль вибраций двигателя по дискретным сигналам
	if (((nvd>=VibDContr)||check)&&VibDHigh_tst) P_VibDHigh_set;									//Повышенная вибрация корпуса двигателя
		else P_VibDHigh_clr;


	if (((nvd>=VibDContr)||check)&&VibDMax_tst) VibDMaxTimer += cycle; else VibDMaxTimer = 0;   //Опасная вибрация корпуса двигателя
	if (VibDMaxTimer>VibDMaxTime) N_VibDMax_set;												
	  else if (externDeblock) N_VibDMax_clr;

//Контроль вибраций двигателя по аналоговым сигналам
	if (VibPp>=VibDPpAlarm) {N_VibPpMax_set;P_VibPpHigh_clr;}		//Опасная вибрация двигателя в зоне ПП
	else {if (externDeblock) N_VibPpMax_clr;
		  if (VibPp>=VibDPpHigh) P_VibPpHigh_set;					//Повышенная вибрация  двигателя в зоне ПП
			else P_VibPpHigh_clr;}

	if (VibZp>=VibDZpAlarm) {N_VibZpMax_set;P_VibZpHigh_clr;}		//Опасная вибрация двигателя в зоне ЗП
	else {if (externDeblock) N_VibZpMax_clr;
		  if (VibZp>=VibDZpHigh) P_VibZpHigh_set;					//Повышенная вибрация  двигателя в зоне ЗП
			else P_VibZpHigh_clr;}

////Контроль роста вибраций	
    z+=cycle;
	if ((z > 1.0)||(z < 0.0)) z = 1.0;
	if (z == 1.0)	{z=0;
				VibPp4=VibPp3;
				VibPp3=VibPp2;
				VibPp2=VibPp1;
				VibPp1=VibPp;

	            VibZp4=VibZp3;
				VibZp3=VibZp2;
				VibZp2=VibZp1;
				VibZp1=VibZp;}

//Контроль роста вибрации корпуса двигателя в зоне Передней Подвески (ПП)
	if (((nvd>Ngg_MG_ust)&&(!up)&&(!down))||check) VibDPPTimer += cycle; else VibDPPTimer = 0;
	if 	(VibDPPTimer > 10000.0) VibDPPTimer = 10000.0;	
	if ((VibPp1-VibPp2)>9&&(VibPp2-VibPp3)>9&&(VibPp3-VibPp4)>9&&(VibDPPTimer>VibDPPTime)) A_RateVibPpMax_set;	// "Высокий рост вибрации двигателя в зоне ПП"
		else if (externDeblock) A_RateVibPpMax_clr;

//Контроль роста вибрации корпуса двигателя в зоне Задней Подвески (ЗП)
		
	if ((VibZp1-VibZp2)>9&&(VibZp2-VibZp3)>9&&(VibZp3-VibZp4)>9&&(VibDPPTimer>VibDPPTime)) A_RateVibZpMax_set;	// "Высокий рост вибрации двигателя в зоне ЗП"
		else if (externDeblock) A_RateVibZpMax_clr;

//Контроль осевой сила ротора СТ
	if ((nvd>=NggmaxFST)||check) osStimer += cycle; else osStimer = 0;		
	if 	(osStimer > 1.0) osStimer = 1.0;
	if  ((osStimer == 1.0)&&(((PizbST+Patm)/(PKizb+Patm))<=0.235)) P_osSTHigh_set;								//"Повышенная осевая сила ротора СТ"
	   else P_osSTHigh_clr;
		
//Контроль высоких оборотов стартера
	if (CVStV_tst) A_CVStVMax_set;																				//"Высокие обороты стартера"						
		else if (externDeblock) A_CVStVMax_clr;

//Контроль стружки в масле СтВ
	if (StrMStV_tst&&((condition<5)||check)) A_StrMStV_set;														//"Стружка в масле СтВ"
		else if (externDeblock) A_StrMStV_clr;

//Контроль повышенного давления газа за СтВ
	if (PoutStVMax_tst&&((condition<5)||check)) A_PoutStVMax_set;												////"Давление газа за СтВ повышенное"
		else if (externDeblock) A_PoutStVMax_clr;
//	if (PoutStVMax_tst&&(condition<5)) A_PoutStVMax_clr;

//Контроль наличия стружки
	if (StrKP_tst) N_StrKPtimer += cycle;else N_StrKPtimer = 0.0;//"Стружка в масле КП"
	if (N_StrKPtimer >= 5.0) N_StrKPtimer = 5.0;
	if (N_StrKPtimer == 5.0) N_StrKP_set;						
		else if (externDeblock) N_StrKP_clr;
		
	if (StrSPK_tst) N_StrSPKtimer += cycle;else N_StrSPKtimer  = 0.0;//"Стружка в линии откачки масла от ШПК"
	if (N_StrSPKtimer  >= 5.0) N_StrSPKtimer  = 5.0;
	if (N_StrSPKtimer  == 5.0) N_StrSPK_set;						
		else if (externDeblock) N_StrSPK_clr;	
	
	if (StrRPT_tst) N_StrRPTtimer += cycle;else N_StrRPTtimer  = 0.0;//"Стружка в линии откачки масла от РПТ"
	if (N_StrRPTtimer  >= 5.0) N_StrRPTtimer  = 5.0;
	if (N_StrRPTtimer  == 5.0) N_StrRPT_set;						
		else if (externDeblock) N_StrRPT_clr;	
	
	if (StrST_tst) N_StrSTtimer += cycle;else N_StrSTtimer  = 0.0;//"Стружка в линии откачки масла от опор СТ"
	if (N_StrSTtimer  >= 5.0) N_StrSTtimer  = 5.0;
	if (N_StrSTtimer  == 5.0) N_StrST_set;						
		else if (externDeblock) N_StrST_clr;	

	if (StrFS_tst) N_StrFStimer += cycle;else N_StrFStimer  = 0.0;//"Стружка в ФС"
	if (N_StrFStimer  >= 5.0) N_StrFStimer  = 5.0;
	if (N_StrFStimer  == 5.0) N_StrFS_set;						
		else if (externDeblock) N_StrFS_clr;	

//Контроль АО от БЗД
	if (aoBZD_tst) A_aoBZD_set;						//АО от БЗД
		else if (externDeblock) A_aoBZD_clr;

//Контроль перепадов на фильтрах
	if (dPMFS_tst) P_dPMFSHigh_set;					//Повышенный перепад на маслофильтре агрегата МФС-94
		else P_dPMFSHigh_clr;

	if (dPBVMF_tst) P_dPBVMFHigh_set;				//Повышенный перепад на маслофильтре агрегата БВМФ-84
		else P_dPBVMFHigh_clr;

//Контроль утечки топливного газа
	if ((PTGPTK>=PtgpdUTtgKS)&&(PTPK<PosDGUTtgKS)&& SK_OFF_tst) UtechkaTGTimer+= cycle;else UtechkaTGTimer=0;
	if (UtechkaTGTimer>(UtechkaTGTime + 5.0)) P_UTtgKS_set;															//"Утечка топливного газа в КС"
		else P_UTtgKS_clr;

	if ((PTPK>PosDGUTtgKS)&& SK_OFF_tst) UtechkaTGnoTimer+= cycle;else UtechkaTGnoTimer=0;
	if (UtechkaTGnoTimer>(UtechkaTGTime + 5.0)) P_UTtgKSno_set;														//"Утечка топливного газа не контролируется"
		else P_UTtgKSno_clr;

//Контроль обратной раскрутки свободной турбины
if (dNst > 0.0) A_ObRaskrST_timer = A_ObRaskrST_timer + cycle;
	else A_ObRaskrST_timer = 0.0;
if (A_ObRaskrST_timer > 0.5) A_ObRaskrST_timer = 0.5;
	if ((nvd<=1600)&&(nst>=300)&&(A_ObRaskrST_timer == 0.5)&&(!HP_tst)&&(!endHP_tst)) A_ObRaskrST_set;		//"Обратная раскрутка ротора СТ"
		else A_ObRaskrST_clr;

//Контроль времени выбега ГГ
if ((!(SZ_tst || VZ_tst)) && (nvd < 1100) && (nvd > 100))	VibegGGTimer+=cycle;								//"Мало время выбега ротора ГГ"
if ((!(SZ_tst || VZ_tst)) && (nvd < 100) && (nvd > 80) && (((VibegGGTimer < 100) && (!endHP_tst)) || ((VibegGGTimer < 80) && (endHP_tst)))) P_VibegGGMin_set;
		 
//Контроль времени выбега СТ
if ((!(SZ_tst || VZ_tst)) && (nst < 1100) && (nst > 100))	VibegSTTimer+=cycle;								//"Мало время выбега ротора СТ"
if ((!(SZ_tst || VZ_tst))&&(!endHP_tst) && (nst < 100) && (nst > 80) && (VibegSTTimer < 50)) P_VibegSTMin_set;
		 
if (externDeblock) {P_VibegGGMin_clr;P_VibegSTMin_clr;}													
if (SZ_tst || VZ_tst) {VibegGGTimer = 0.0;VibegSTTimer = 0.0;P_VibegGGMin_clr;P_VibegSTMin_clr;}
													
													
//    Проверка исполнительных механизмов
//Проверка клапанов
	if ((KPV_ON_tst != KPV_ONpos)&&(nvd>nGGcontrKPV)) KPVBrkTimer+=cycle;else KPVBrkTimer=0.0;
	if (KPVBrkTimer >= KPVBrkTime) KPVBrkTimer = KPVBrkTime;
	if (KPVBrkTimer >= KPVBrkTime) P_KPVBrk_set;else P_KPVBrk_clr;

	if ((KPG_ON_tst != KPG_ONpos)&&(nvd>nGGcontrKPV)) KPGBrkTimer+=cycle;else KPGBrkTimer=0.0;
	if (KPGBrkTimer >= KPGBrkTime) KPGBrkTimer = KPGBrkTime;
	if (KPGBrkTimer >= KPGBrkTime) P_KPGBrk_set;else P_KPGBrk_clr;
	
	if (KPV_ONBrk&&(nvdNorm<(Ngg_MG_ust-30))) A_KPVIMBrk_set;else if (externDeblock) A_KPVIMBrk_clr;
	
	if (KPG_ONBrk&&(nvdNorm<(Ngg_MG_ust-30))) A_KPGIMBrk_set;else if (externDeblock) A_KPGIMBrk_clr;	//!Обрыв цепи открытия КПВЗ, КПГ	F20HS1

//Проверка ОГК
	if ((setSK_ON_tst == SK_OFF_tst)&&(SKBrkOnTimer<=(SKNotOnFireTime + 1.0))) SKBrkOnTimer = SKBrkOnTimer + cycle;else SKBrkOnTimer=0;
	if (SKBrkOnTimer>=(SKNotOnFireTime + 1.0)) A_SKBrk_set;else if (externDeblock) A_SKBrk_clr;//

//Проверка ВНА
	if ((FDBSKT1)||(measureVNA1<minValVNA)||(measureVNA1>maxValVNA)) VNABrkDopTimer += cycle;else VNABrkDopTimer=0; 
	if (VNABrkDopTimer>maxDeltaVNANegTime) A_VNABrkDop_set;
			else if (externDeblock) A_VNABrkDop_clr;
	
	if ((nvd>nGGcontrVNA)||check)
	{if ((setVNA-measureVNA1)>DeltaVNAHigh) maxDeltaVNAPosTimer+= cycle;
		else maxDeltaVNAPosTimer = 0;
	if (maxDeltaVNAPosTimer > 100) maxDeltaVNAPosTimer = 100;
	if (maxDeltaVNAPosTimer>maxDeltaVNAPosTime) A_VNABrk_Pos_set;
		else if (externDeblock) A_VNABrk_Pos_clr;
		
	if ((setVNA-measureVNA1)<DeltaVNALow) maxDeltaVNANegTimer+= cycle;
		else maxDeltaVNANegTimer = 0;
	if (maxDeltaVNANegTimer > 100) maxDeltaVNANegTimer = 100;
	if (maxDeltaVNANegTimer>maxDeltaVNANegTime) A_VNABrk_Neg_set;
		else if (externDeblock) A_VNABrk_Neg_clr;
	}
    else if (externDeblock) {A_VNABrk_Neg_clr; A_VNABrk_Pos_clr;}

//Проверка дозатора
	if (((PTPK<minValDUS)||(PTPK>maxValDUS))&&((condition>1)||check)&&((condition!=6)||check)) A_DozBrkDop_set;
		else if (externDeblock) A_DozBrkDop_clr;
	
	if ((abs(setDoz-PTPK))>maxDeltaDUS) maxTimeDeltaDUSr += cycle;
	else maxTimeDeltaDUSr = 0;
	if (((maxTimeDeltaDUSr > maxTimeDeltaDUS)||setDozBrk||PTPKBrk)&&((condition>1)||check)&&((condition!=6)||check)) A_DozBrk_set;
		else if (externDeblock) A_DozBrk_clr;

//Погасание КС на запуске
if ((dNvd < -100.0)&&(dTtzap < -25.0)&&(nvd<Ngg_MG_ust)) PogasTimer+=cycle;
else PogasTimer=0.0;

if (PogasTimer >= 1.0) A_Pogas_set; 
	else if (externDeblock) A_Pogas_clr;		
		
//Алгоритм помпажа
if ((dNvd < -100.0)&&(dTtzap > 100.0)) PompazTimer+=cycle;
else PompazTimer=0.0;

if (PompazTimer >= 0.1) A_Pompaz_set; 
	else if (externDeblock) A_Pompaz_clr;	

	
//Сборка требований НО
	if (N_TtHigh_tst||N_PtgHigh_tst||N_PmvhDmin_tst||N_PsufMax_tst||N_deltaPvxMax_tst||N_TmspKvdMax_tst||N_TmrpTvdMax_tst||N_TstHigh_tst||
		N_VibPpMax_tst||N_VibZpMax_tst||N_VibDMax_tst||
		N_StrSPK_tst||N_StrKP_tst||N_TmopStMax_tst||N_StrRPT_tst||N_StrST_tst||N_TtBrk_tst||N_StrFS_tst||N_TstBrk_tst||externNO) N_common_set;
		else if (externDeblock) N_common_clr;

//!!!!!	if (externAO) P_NstHigh_set else if (externDeblock) P_NstHigh_clr;!

//Сборка аварий!
	if (A_NvdBrk_tst||A_NvdDistort_tst||A_Ttzap_tst||A_Pompaz_tst||A_NstBrk_tst||A_NstDistort_tst||A_TtTtzapBrk_tst||
		A_NggLow_tst||A_NggHigh_tst||A_TtHigh_tst||A_Pogas_tst||A_TstHigh_tst||A_NstHigh_tst||A_ObRaskrST_tst||
		A_DozBrk_tst||A_VNABrk_Neg_tst||A_VNABrk_Pos_tst||A_DozBrkDop_tst||A_VNABrkDop_tst||
		A_PtgMax_tst||A_PmvhDno_tst||A_PtgMin_tst||A_PgInStVmax_tst||A_PgInStVmin_tst||A_PgInStVmin_proval_tst||
		A_PmvhDmin_tst||A_TmspKvdMax_tst||A_TmrpTvdMax_tst||A_TmopStMax_tst||
		/*A_VibPpMax_tst||A_VibZpMax_tst||Закоментировано 08112010*/A_RateVibPpMax_tst||A_RateVibZpMax_tst||A_STbrk_tst||
		/*A_VibDMax_tst||*/A_CVStVMax_tst||A_StrMStV_tst||A_PoutStVMax_tst||A_aoBZD_tst||externAO||
		(A_SKBrk_tst&&(condition>1)&&(!HP_tst)&&(condition!=6))||//Исправлено Полулях 24.11.10
		(A_KPVIMBrk_tst&&(condition>1)&&(!HP_tst)&&(condition!=6))||
		(A_KPGIMBrk_tst&&(condition>1)&&(!HP_tst)&&(condition!=6))
		) A_common_set;
		else if (externDeblock) A_common_clr;

//Сборка готовностей
	if ((nvd<NggGotovHPZP)&&(!P_PtgHigh_tst)&&(!P_PtgLow_tst)&&(!A_CVStVMax_tst)&&(!A_KPVIMBrk_tst)&&(!A_KPGIMBrk_tst)&&(!A_StrMStV_tst)&&(PgInStV>PgInStVLow)&&(PgInStV<PgInStVHigh)&&
		(!A_CVStVMax_tst)&&(!A_StrMStV_tst)&&(!A_PoutStVMax_tst)&&(!A_common_tst)&&(!N_common_tst)&&(!P_UTtgKS_tst)&&(!StV_ON_tst)&&(!startProm)&&(!startHP)) GotovZap_set;
		else GotovZap_set;

// Готовность к холодной прокрутке		
	if (startHP && ((nvd<NggGotovHPZP)&&(!A_CVStVMax_tst)&&(!A_StrMStV_tst)&&(PgInStV>PgInStVLow)&&(PgInStV<PgInStVHigh)&&
		(!A_PoutStVMax_tst)&&(!A_common_tst)&&(!N_common_tst)&&(!P_UTtgKS_tst)&&(!StV_ON_tst)&&(!startProm))) GotovHP_set;
		else GotovHP_clr;
	
// Готовность к промывке
	if (startProm && ((nvd<NggGotovHPZP)&&(!A_CVStVMax_tst)&&(!A_StrMStV_tst)&&(PgInStV>PgInStVLow)&&(PgInStV<PgInStVHigh)&&
		(!A_PoutStVMax_tst)&&(!A_common_tst)&&(!N_common_tst)&&(!P_UTtgKS_tst)&&(!StV_ON_tst)&&(!startHP))) GotovProm_set;
		else GotovProm_clr;
		
		
if (condition == 1) {A_common_clr;N_common_clr;}
if (externDeblock) {A_common_clr;N_common_clr;}

//if ((check) && (nvd < 100.0)) A_common_clr;
	
//	I=I+1;
//}



return GEF_EXECUTION_OK;
}




